#ifndef BATTLE_H
#define BATTLE_H

#include "types.h"
#include "sprite.h"

#define MAX_MOVE_NUM 742 //old 467
#define CLIENT_MAX 4

#define TYPE_NORMAL   0x00
#define TYPE_FIGHTING 0x01
#define TYPE_FLYING   0x02
#define TYPE_POISON   0x03
#define TYPE_GROUND   0x04
#define TYPE_ROCK     0x05
#define TYPE_BUG      0x06
#define TYPE_GHOST    0x07
#define TYPE_STEEL    0x08
#define TYPE_MYSTERY  0x09
#define TYPE_FIRE     0x0a
#define TYPE_WATER    0x0b
#define TYPE_GRASS    0x0c
#define TYPE_ELECTRIC 0x0d
#define TYPE_PSYCHIC  0x0e
#define TYPE_ICE      0x0f
#define TYPE_DRAGON   0x10
#define TYPE_DARK     0x11

#define SELECT_FIGHT_COMMAND 1
#define SELECT_ITEM_COMMAND 2
#define SELECT_POKEMON_COMMAND 3
#define SELECT_ESCAPE_COMMAND 4


// add effect defines
#define ADD_STATUS_NO_ABILITY (0x08000000)

#define ADD_EFFECT_INDIRECT 2
#define ADD_EFFECT_ABILITY 3

#define ADD_EFFECT_HELD_ITEM 5

#define ADD_STATE_ATTACK_UP 0xF
#define ADD_STATE_DEFENSE_UP 0x10
#define ADD_STATE_SPEED_UP 0x11
#define ADD_STATE_SP_ATK_UP 0x12
#define ADD_STATE_SP_DEF_UP 0x13
#define ADD_STATE_ACCURACY_UP 0x14
#define ADD_STATE_EVASION_UP 0x15
#define ADD_STATE_ATTACK_DOWN 0x16
#define ADD_STATE_DEFENSE_DOWN 0x17
#define ADD_STATE_SPEED_DOWN 0x18
#define ADD_STATE_SP_ATK_DOWN 0x19
#define ADD_STATE_SP_DEF_DOWN 0x1A
#define ADD_STATE_ACCURACY_DOWN 0x1B
#define ADD_STATE_EVASION_DOWN 0x1C

#define ADD_STATE_ATTACK_UP_2 0x27
#define ADD_STATE_DEFENSE_UP_2 0x28
#define ADD_STATE_SPEED_UP_2 0x29

    int tokusyu_otf_damage[4];
    int tokusyu_otf_client;
    int tokusyu_otf_client_bit;
    int last_otf_damage;
    int last_otf_client;
    int dameoshi_damage;
};

struct __attribute__((packed)) OneSelfTurnEffect
{
    u32 no_pressure_flag : 1;  ///<特性プレッシャーの効果を受けない
    u32 hiraisin_flag : 1;     ///<特性ひらいしんの効果が発動
    u32 yobimizu_flag : 1;     ///<特性よびみずのの効果が発動
    u32 mold_breaker_flag : 1;   ///<特性かたやぶりの効果が発動
    u32 trickroom_flag : 1;    ///<トリックルーム発動
    u32 item_koraeru_flag : 1; ///<こらえるフラグ（装備道具効果）
    u32 korogaru_count : 3;    ///<ころがるカウント（メトロノーム判定で使用）
    u32 : 23;                  ///<ステータス上昇下降エフェクトを発動

    int physical_damage;   ///存在物理伤害量
    int physical_damager;   ///<物理攻撃したクライアント
    int special_damage;   ///存在特殊伤害量
    int special_damager;   ///<特殊攻撃したクライアント
    int status_flag;           ///<ステータスフラグ（battle_server.hにdefine定義）
    int kaigara_damage;        ///<かいがらのすず用ダメージ量
};

struct __attribute__((packed)) battle_moveflag
{
    u32 kanashibari_count : 3;      ///<かなしばりカウンタ
    u32 encore_count : 3;           ///<アンコールカウンタ
    u32 juuden_count : 2;           ///<じゅうでんカウンタ
    u32 chouhatsu_count : 3;        ///<ちょうはつカウンタ
    u32 success_count : 2;          ///<まもる、こらえるが成功したカウンタ
    u32 horobinouta_count : 2;      ///<ほろびのうたカウンタ
    u32 korogaru_count : 3;         ///<ころがるカウンタ
    u32 renzokugiri_count : 3;      ///<れんぞくぎりカウンタ
    u32 takuwaeru_count : 3;        ///<たくわえるカウンタ
    u32 takuwaeru_def_count : 3;    ///<たくわえるカウンタ（防御アップ）
    u32 takuwaeru_spedef_count : 3; ///<たくわえるカウンタ（特防アップ）
    u32 namake_bit : 1;             ///<なまけビット
    u32 moraibi_flag : 1;           ///<もらいびフラグ

    u32 lockon_client_no : 2;    ///<ロックオンされたClientNo
    u32 monomane_bit : 4;        ///<ものまねビット
    u32 shime_client_no : 2;     ///<しめつけたClientNo
    u32 manazashi_client_no : 2; ///<くろいまなざしをしたClientNo
    u32 totteoki_count : 3;      ///<とっておき用技を出したフラグ
    u32 denzihuyuu_count : 3;    ///<でんじふゆうカウンタ
    u32 healblock_count : 3;     ///<ヒールブロックカウンタ
    u32 embargo_count : 3;       ///<シャットアウトカウンタ
    u32 unburden_flag : 1;       ///<かるわざフラグ
    u32 metronome_work : 4;      ///<メトロノームワーク
    u32 boost_accuracy_once : 1;         ///<装備効果で一度だけ命中UPフラグ
    u32 raise_speed_once : 1;         ///<装備効果で一度だけ先制攻撃フラグ
    u32 quick_claw_flag : 1;
    u32 sakidori_flag : 1;
    u32 : 1;

    int handou_count;
    int fake_out_count;
    int slow_start_count;
    int sakidori_count;
    int migawari_hp;
    u32 henshin_rnd;

    u16 kanashibari_wazano;
    u16 shime_wazano;
    u16 encore_wazano;
    u16 encore_wazapos;
    u16 totteoki_wazano[4];
    u16 kodawari_wazano;
    u16 henshin_sex;

    int item_hp_recover;
};
struct __attribute__((packed)) BattlePokemon
{
    u16 species;
    u16 attack;
    u16 defense;
    u16 speed;
    u16 spatk;
    u16 spdef;
    u16 move[4];
    u32 hp_iv : 5;
    u32 atk_iv : 5;
    u32 def_iv : 5;
    u32 spe_iv : 5;
    u32 spatk_iv : 5;
    u32 spdef_iv : 5;
    u32 is_egg : 1;
    u32 have_nickname : 1;
    s8 states[8];
    int weight;
    u8 type1; //25
    u8 type2;
    u8 form_no : 5;
    u8 rare : 1;
    u8 ability;

    u32 appear_check_flag : 1;   //2ch  登場時天候系特性チェックをしたかどうか
    u32 intimidate_flag : 1;          //2ch  登場時いかくチェックしたかどうか
    u32 trace_flag : 1;          //2ch  登場時トレースチェックしたかどうか
    u32 download_flag : 1;       //2ch  登場時ダウンロードチェック
    u32 anticipation_flag : 1;     //2ch  登場時きけんよちチェック
    u32 forewarn_flag : 1;        //2ch  登場時よちむチェック
    u32 slow_start_flag : 1;     //2ch  登場時スロースタートチェック
    u32 slow_start_end_flag : 1; //2ch  スロースタート終了チェック
    u32 frisk_flag : 1;      //2ch  登場時おみとおしチェック
    u32 mold_breaker_flag : 1;     //2ch  登場時かたやぶりチェック
    u32 pressure_flag : 1;       //2ch  登場時プレッシャーチェック
    u32 canMega : 1;
    u32 unnerve_flag : 1;
    u32 dark_aura_flag : 1;
    u32 fairy_aura_flag : 1;
    u32 aura_break_flag : 1;
    u32 : 19;                    //2ch

    u8 pp[4];
    u8 pp_count[4];
    u8 level;
    u8 friend;
    u16 nickname[11];
    s32 hp;
    u32 maxhp;
    u16 oyaname[8];
    u32 exp; //68
    u32 personal_rnd;
    u32 condition;
    u32 condition2;
    u32 id_no;
    u16 item;
    u16 dummy;
    u8 hit_count;
    u8 message_flag;
    u8 sex : 4;
    u8 oyasex : 4;
    u8 get_ball;
    u32 effect_of_moves; // think like charge, lock on
    u32 effect_of_moves_temp;

    struct __attribute__((packed)) battle_moveflag moveeffect;
};

typedef struct {
    u32 alloc_size;
    u32 alloc_ofs;
    u16 type;       // Vram確保した表示面
    u16 conttype;   // 管理方法
} __attribute__((packed)) CHAR_MANAGER_ALLOCDATA;

struct __attribute__((packed)) field_condition_count
{
    u32     weather_count;                      ///<天候変化用カウンタ

    u8      miraiyochi_count[CLIENT_MAX];       ///<みらいよちカウンタ
    u8      negaigoto_count[CLIENT_MAX];        ///<ねがいごとカウンタ

    u16     miraiyochi_wazano[CLIENT_MAX];      ///<みらいよち技ナンバーワーク
    int     miraiyochi_client_no[CLIENT_MAX];   ///<みらいよちしたClientNo
    s32     miraiyochi_damage[CLIENT_MAX];      ///<みらいよちダメージ

    u8      negaigoto_sel_mons[CLIENT_MAX];     ///<ねがいごとをしたポケモンの手持ちの位置
};

struct __attribute__((packed)) tcb_skill_intp_work
{
    void *bw;
    struct BattleStruct *sp;
    void *bms;
    void *cap[2]; ///<控えポケモンレベルアップ用アイコン表示
    void *fop;    ///<控えポケモンレベルアップ用アイコン表示
    CHAR_MANAGER_ALLOCDATA cma;
    int flag;
    int seq_no;
    int ballID; ///<ポケモンゲット時の投げるボールID
    int work[8];
    void *work_p[2]; ///<汎用ワークポインタ
};

typedef struct
{
    u8  command_code;
    u8  msg_tag;
    u16 msg_id;
    int msg_para[6];
    int msg_keta;
    int msg_client;
} __attribute__((packed)) MESSAGE_PARAM;

struct __attribute__((packed)) side_condition_work
{
    u32     butsuri_guard_client    : 2;        ///<物理ガード効果を発生させたClientNoを格納
    u32     butsuri_guard_count     : 3;        ///<物理ガード効果カウンタ
    u32     tokusyu_guard_client    : 2;        ///<特殊ガード効果を発生させたClientNoを格納
    u32     tokusyu_guard_count     : 3;        ///<特殊ガード効果カウンタ
    u32     shiroikiri_client       : 2;        ///<しろいきり効果を発生させたClientNoを格納
    u32     mist_count        : 3;        ///<しろいきり効果カウンタ
    u32     shinpi_client           : 2;        ///<しんぴのまもり効果を発生させたClientNoを格納
    u32     shinpi_count            : 3;        ///<しんぴのまもり効果カウンタ

    u32     konoyubitomare_flag     : 1;        ///<このゆびとまれフラグ
    u32     konoyubitomare_client   : 2;        ///<このゆびとまれを発動したClientNo
    u32     hatakiotosu_item        : 6;        ///<はたきおとすされているSelMonsNoをbitで格納
    u32     oikaze_count            : 3;        ///<おいかぜカウンタ

    u32     makibisi_count          : 2;        ///<まきびしカウンタ
    u32     dokubisi_count          : 2;        ///<どくびしカウンタ
    u32                             :28;
};

struct __attribute__((packed)) BattleStruct
{
    /*0x0*/ u8 com_seq_no[CLIENT_MAX];
    /*0x4*/ u8 ret_seq_no[CLIENT_MAX];
    /*0x8*/ int server_seq_no;
    /*0xC*/ int next_server_seq_no;
    /*0x10*/ int fcc_seq_no;
    /*0x14*/ int fcc_work;
    /*0x18*/ int pcc_seq_no;
    /*0x1C*/ int pcc_work;
    /*0x20*/ int scc_seq_no;
    /*0x24*/ int scc_work;
    /*0x28*/ int sba_seq_no;
    /*0x2C*/ int sba_work;
    /*0x30*/ int swhac_seq_no;
    /*0x34*/ int swhac_work;
    /*0x38*/ int swoam_type;
    /*0x3C*/ int swoam_seq_no;
    /*0x40*/ int swoak_seq_no;
    /*0x44*/ int swoak_work;
    /*0x48*/ int wb_seq_no;
    /*0x4c*/ int woc_seq_no;
    /*0x50*/ int ssc_seq_no;
    /*0x54*/ int stc_seq_no;
    /*0x58*/ int switch_in_check_seq_no;
    /*0x5C*/ int svc_work;

    /*0x60*/ int waza_seq_adrs;
    /*0x64*/ int attack_client;
    /*0x68*/ int attack_client_temp;
    /*0x6C*/ int defence_client;
    /*0x70*/ int defence_client_temp;
    /*0x74*/ int fainting_client;
    /*0x78*/ int reshuffle_client;
    /*0x7C*/ int reshuffle_client_temp;
    /*0x80*/ int ability_client;
    /*0x84*/ int magic_cort_client;

    /*0x88*/ int addeffect_type;
    /*0x8C*/ int addeffect_param;
    /*0x90*/ int addeffect_flag;

    /*0x94*/ int state_client;
    /*0x98*/ int push_client;                            
    /*0x9C*/ int get_exp;                                
    /*0xA0*/ int gakusyuu_get_exp;                       
    /*0xA4*/ u32 get_exp_right_flag[2];                  
    /*0xAC*/ int skill_arc_kind;                         
    /*0xB0*/ int skill_arc_index;                        
    /*0xB4*/ int skill_seq_no;                           
    /*0xB8*/ int push_count;                             
    /*0xBC*/ int push_skill_arc_kind[4];   
    /*0xCC*/ int push_skill_arc_index[4];  
    /*0xDC*/ int push_skill_seq_no[4];     
    /*0xEC*/ int agi_cnt;                                
    /*0xF0*/ int wait_cnt;                               
    /*0xF4*/ MESSAGE_PARAM mp;
    /*0x118*/ int client_work;
    /*0x11C*/ int attack_client_work;
    /*0x120*/ int defence_client_work;
    /*0x124*/ int waza_work;
    /*0x128*/ int item_work;
    /*0x12C*/ int tokusei_work;
    /*0x130*/ int msg_work;
    /*0x134*/ int calc_work;
    /*0x138*/ int temp_work;
    /*0x13C*/ u32 client_status[CLIENT_MAX];
    /*0x14C*/ u32 koban_counter;
    /*0x150*/ int total_turn;
    /*0x154*/ int total_hinshi[CLIENT_MAX];
    /*0x164*/ int total_damage[CLIENT_MAX];
    /*0x174*/ int sakidori_total_turn;
    /*0x178*/ struct tcb_skill_intp_work *tciw;
    /*0x17C*/ void *work;
    /*0x180*/ u32 field_condition;
    /*0x184*/ struct field_condition_count fcc;
    /*0x1BC*/ u32 side_condition[2];
    /*0x1C4*/ struct side_condition_work scw[2];
    /*0x1D4*/ struct OneTurnEffect oneTurnFlag[4];
    /*0x2D4*/ struct OneSelfTurnEffect oneSelfFlag[4];
    /*0x344*/ u8 dummy3[0x9A]; // wocf, AIWT start

    /*0x3DE*/ struct BattleMove old_moveTbl[467 + 1]; //old
    /*0x211E*/ u8 dummy6[0x1E]; // fuck the rest of ai stuff
    /*0x213C*/ u32 server_status_flag;
    /*0x2140*/ u32 server_status_flag2;
    /*0x2144*/ int damage;
    /*0x2148*/ int hit_damage;
    /*0x214C*/ int critical_count;
    /*0x2150*/ int critical;
    /*0x2154*/ int damage_power;
    /*0x2158*/ int damage_value;
    /*0x215C*/ int hp_calc_work;
    /*0x2160*/ int move_type;
    /*0x2164*/ int waza_eff_cnt;
    /*0x2168*/ int money_multiplier;
    /*0x216C*/ u32 waza_status_flag;

    /*0x2170*/ u32 add_status_flag_direct;
    u32 add_status_flag_indirect;
    u32 add_status_flag_tokusei;
    u8 renzoku_count;
    u8 renzoku_count_temp;
    u8 client_loop;
    u8 hukurodataki_count;

    u32 loop_flag;
    u32 waza_out_check_on_off;
    u32 loop_hit_check;

    u32 condition2_off_req[CLIENT_MAX];
    /*0x219C*/ u8 sel_mons_no[CLIENT_MAX];
    /*0x21A0*/ u8 reshuffle_sel_mons_no[CLIENT_MAX];
    /*0x21A4*/ u8 ai_reshuffle_sel_mons_no[CLIENT_MAX];
    /*0x21A8*/ u32 client_act_work[4][4];
    /*0x21E8*/ u8 client_agi_work[4];
    /*0x21EC*/ u8 turn_order[4];
    /*0x21F0*/ u32 psp_agi_point[4];
    /*0x2200*/ u8 ServerQue[4][4][16];
    /*0x2300*/ u8 server_buffer[4][256];
    /*0x2700*/ int SkillSeqWork[400];
    /*0x2D40*/ struct BattlePokemon battlemon[CLIENT_MAX]; //0xc0
    /*0x3040*/ u32 waza_no_temp;
    /*0x3044*/ u32 current_move_index;
    // u8 unk_bytes4[0x74];
    
    /*0x3048*/ u32 waza_no_last;
    /*0x304C*/ u32 waza_no_keep[CLIENT_MAX];
    
    /*0x305C*/ u16 waza_no_mamoru[CLIENT_MAX];
    /*0x    */ u16 waza_no_hit[CLIENT_MAX];
    /*0x    */ u16 waza_no_hit_client[CLIENT_MAX];
    /*0x    */ u16 waza_no_hit_type[CLIENT_MAX];
    /*0x    */ u16 waza_no_old[CLIENT_MAX];
    /*0x    */ u16 waza_no_oumu[CLIENT_MAX];
    /*0x    */ u16 waza_no_oumu_hit[CLIENT_MAX][CLIENT_MAX];
    /*0x    */ u16 waza_no_sketch[CLIENT_MAX];
    /*0x    */ u16 waza_no_select[CLIENT_MAX];
    
    /*0x30BC*/ u16 waza_no_pos[CLIENT_MAX];
    /*0x30C4*/ //u8 unk_bytes_4[0x44];
    /*0x    */ u16 waza_no_texture2[CLIENT_MAX];
    /*0x    */ u16 waza_no_texture2_client[CLIENT_MAX];
    /*0x    */ u16 waza_no_texture2_type[CLIENT_MAX];
    /*0x    */ u16 waza_no_metronome[CLIENT_MAX];
        
    /*0x    */ int store_damage[CLIENT_MAX];                    ///<がまん用のダメージストックワーク
        
    /*0x    */ int client_no_hit[CLIENT_MAX];                   ///<技を最後に当てたClientNoを格納
        
    /*0x    */ int client_no_agi;
    
    /*0x3108*/ u8 no_reshuffle_client;
    /*0x3109*/ u8 level_up_pokemon;
    /*0x310A*/ u16 que_check_wait;
    /*0x310C*/ u16 agi_rand[CLIENT_MAX];
    /*0x3114*/ int nagetsukeru_work;
    /*0x3118*/ int nagetsukeru_seq_no;
    /*0x311C*/ u8 safari_get_count;
    /*0x311D*/ u8 safari_escape_count;
    /*0x311E*/ u8 escape_count;
    /*0x311F*/ u8 fight_end_flag;

    /*0x3120*/ u8 magnitude;
    /*0x3121*/ u8 weather_check_flag;
    /*0x3122*/ s16 hp_temp;

    /*0x3124*/ u16 recycle_item[CLIENT_MAX];
    /*0x312C*/ u8 unk4[0x52];
    /*0x317E*/ struct BattleMove moveTbl[MAX_MOVE_NUM + 1];
    /*...*/
};

enum
{
    CHECK_PLAYER_SIDE_ALL = 0,
    CHECK_PLAYER_SIDE_ALIVE,
    CHECK_ENEMY_SIDE_ALL,
    CHECK_ENEMY_SIDE_ALIVE,
    CHECK_ALL_BATTLER_ALIVE = 8,
};

enum
{
    BATTLE_MON_DATA_SPECIES,
    BATTLE_MON_DATA_ATK,
    BATTLE_MON_DATA_DEF,
    BATTLE_MON_DATA_SPE,
    BATTLE_MON_DATA_SPATK,
    BATTLE_MON_DATA_SPDEF,
    BATTLE_MON_DATA_MOVE_1,
    BATTLE_MON_DATA_MOVE_2,
    BATTLE_MON_DATA_MOVE_3,
    BATTLE_MON_DATA_MOVE_4,
    BATTLE_MON_DATA_HP_RND,
    BATTLE_MON_DATA_ATK_RND,
    BATTLE_MON_DATA_DEF_RND,
    BATTLE_MON_DATA_SPD_RND,
    BATTLE_MON_DATA_SPATK_RND,
    BATTLE_MON_DATA_SPDEF_RND,
    BATTLE_MON_DATA_IS_EGG,
    BATTLE_MON_DATA_IS_NICKNAMED,
    BATTLE_MON_DATA_STATE_HP,
    BATTLE_MON_DATA_STATE_ATK,
    BATTLE_MON_DATA_STATE_DEF,
    BATTLE_MON_DATA_STATE_SPE,
    BATTLE_MON_DATA_STATE_SPATK,
    BATTLE_MON_DATA_STATE_SPDEF,
    BATTLE_MON_DATA_STATE_ACCURACY,
