#ifndef BATTLE_H
#define BATTLE_H

#include "types.h"
#include "item.h"
#include "sprite.h"
#include "task.h"
#include "constants/moves.h"

#define CLIENT_MAX 4

#define TYPE_NORMAL   0x00
#define TYPE_FIGHTING 0x01
#define TYPE_FLYING   0x02
#define TYPE_POISON   0x03
#define TYPE_GROUND   0x04
#define TYPE_ROCK     0x05
#define TYPE_BUG      0x06
#define TYPE_GHOST    0x07
#define TYPE_STEEL    0x08
#define TYPE_MYSTERY  0x09
#define TYPE_FAIRY    0x09
#define TYPE_FIRE     0x0a
#define TYPE_WATER    0x0b
#define TYPE_GRASS    0x0c
#define TYPE_ELECTRIC 0x0d
#define TYPE_PSYCHIC  0x0e
#define TYPE_ICE      0x0f
#define TYPE_DRAGON   0x10
#define TYPE_DARK     0x11

#define SELECT_FIGHT_COMMAND 1
#define SELECT_ITEM_COMMAND 2
#define SELECT_POKEMON_COMMAND 3
#define SELECT_ESCAPE_COMMAND 4


// add effect defines
#define ADD_STATUS_NO_ABILITY (0x08000000)

#define ADD_EFFECT_DIRECT 1
#define ADD_EFFECT_INDIRECT 2
#define ADD_EFFECT_ABILITY 3
#define ADD_EFFECT_MOVE_EFFECT 4
#define ADD_EFFECT_HELD_ITEM 5
#define ADD_EFFECT_TOXIC_SPIKES 6
#define ADD_EFFECT_VARIOUS 7
// new
#define ADD_EFFECT_PRINT_WORK_ABILITY 8


#define ADD_STATE_ATTACK_UP 0xF
#define ADD_STATE_DEFENSE_UP 0x10
#define ADD_STATE_SPEED_UP 0x11
#define ADD_STATE_SP_ATK_UP 0x12
#define ADD_STATE_SP_DEF_UP 0x13
#define ADD_STATE_ACCURACY_UP 0x14
#define ADD_STATE_EVASION_UP 0x15
#define ADD_STATE_ATTACK_DOWN 0x16
#define ADD_STATE_DEFENSE_DOWN 0x17
#define ADD_STATE_SPEED_DOWN 0x18

#define TAG_NICK_ITEM_NICK              (43)    //nickname      helditem        nickname
#define TAG_NICK_ITEM_MOVE              (44)    //nickname      helditem        move
#define TAG_NICK_ITEM_STAT              (45)    //nickname      helditem        stat
#define TAG_NICK_ITEM_COND              (46)    //nickname      helditem        condition
#define TAG_NICK_BOX_BOX                (47)    //nickname      box             box
#define TAG_ITEM_NICK_TASTE             (48)    //helditem      nickname        taste
#define TAG_TRNAME_NICK_NICK            (49)    //trainername   nickname        nickname
#define TAG_TRTYPE_TRNAME_NICK          (50)    //trainertitle  trainername     nickname
#define TAG_TRTYPE_TRNAME_ITEM          (51)    //trainertitle  trainername     helditem

#define TAG_NICK_ABILITY_NICK_MOVE      (52)    //nickname      ability         nickname        move
#define TAG_NICK_ABILITY_NICK_ABILITY   (53)    //nickname      ability         nickname        ability
#define TAG_NICK_ABILITY_NICK_STAT      (54)    //nickname      ability         nickname        stat
#define TAG_NICK_ITEM_NICK_ITEM         (55)    //nickname      helditem        nickname        helditem
#define TAG_TRNAME_NICK_TRNAME_NICK     (56)    //trainername   nickname        trainername     nickname
#define TAG_TRTYPE_TRNAME_NICK_NICK     (57)    //trainertitle  trainername     nickname        nickname
#define TAG_TRTYPE_TRNAME_NICK_TRNAME   (58)    //trainertitle  trainername     nickname        trainername
#define TAG_TRTYPE_TRNAME_TRTYPE_TRNAME (59)    //trainertitle  trainername     trainertitle    trainername

#define TAG_TRTYPE_TRNAME_NICK_TRTYPE_TRNAME_NICK \
                                        (60)    //trainertitle  trainername     nickname        trainertitle  trainername     nickname


#define TAG_NO_DIR                      (0x80)
#define TAG_DIR                         (0x40)
#define TAG_NO_DIR_OFF                  (0x3f)


// fuck statbuffchange
#define STATUS_EFF_UP (12)
#define STATUS_EFF_DOWN (13)


//held item attack effect
#define ATK_CHECK_NORMAL    (0)
#define ATK_CHECK_NONE      (1)
#define ATK_CHECK_SHUTOUT   (2)

//inc record
#define CLIENT_BOOT_TYPE_MINE       (0)
#define CLIENT_BOOT_TYPE_NOMINE     (1)

//save data
#define RECID_TEMOTI_MAKIZOE (71+26)

//ai condition flags 2
#define CONDITION2_TRANSFORM        (0x00200000)
#define CONDITION2_TRANSFORM_OFF    (0x00200000 ^ 0xffffffff)
#define CONDITION2_SUBSTITUTE       (0x01000000)
#define CONDITION2_SUBSTITUTE_OFF   (0x01000000^0xffffffff)

#define SWOAM_NORMAL    (0)
#define SWOAM_LOOP      (1)


// (possibly) implement challenge/ easy modes
#define NORMAL_MODE (0)
#define CHALLENGE_MODE (1)
#define EASY_MODE (2)

// msg work
enum
{
    MSG_HEAL_SLEEP = 0,
    MSG_HEAL_POISON,
    MSG_HEAL_BURN,
    MSG_HEAL_PARALYSIS,
    MSG_HEAL_FROZEN,
};

// archives to load from
enum
{
    FILE_MOVE_BATTLE_SCRIPTS = 0,
    FILE_BATTLE_SUB_SCRIPTS,
};


struct __attribute__((packed)) BattleMove
{
    u16 effect; //0x0
    u8 split; //0x2
    u8 power; //0x3

    u8 type; //0x4
    u8 accuracy; //0x5
    u8 pp; //0x6
    u8 secondaryEffectChance; //0x7

    u16 target; //0x8
    s8 priority; //0xA
    u8 flag; //0xB
    u8 unk[4]; //0xC, length = 4

    //this takes up 0x10
};

struct __attribute__((packed)) OneTurnEffect
{
    u32 struggle_flag : 1;
    u32 pp_dec_flag : 1;
    u32 mamoru_flag : 1;
    u32 helping_hand_flag : 1;
    u32 magic_cort_flag : 1;
    u32 yokodori_flag : 1;
    u32 haneyasume_flag : 1;
    u32 escape_flag : 2;
    u32 prevent_one_hit_ko_ability : 1;
    u32 : 22;

    int physical_damage[4];
    int physical_damager;
    int physical_damager_bit;
    int special_damage[4];
    int special_damager;
    int special_damager_bit;
    int last_damage;
    int last_damager;
    int dameoshi_damage;
};

struct __attribute__((packed)) OneSelfTurnEffect
{
    //0x0
    u32 no_pressure_flag : 1;
    u32 hiraisin_flag : 1;
    u32 yobimizu_flag : 1;
    u32 mold_breaker_flag : 1;
    u32 trickroom_flag : 1;
    u32 prevent_one_hit_ko_item : 1;
    u32 korogaru_count : 3;
    u32 defiant_flag : 1; // set (hypothetically) when defiant needs to activate
    u32 : 22;

    int physical_damage;
    int physical_damager;
    int special_damage;
    int special_damager;
    int status_flag;
    int shell_bell_damage;

    //length 0x1C
};

struct __attribute__((packed)) MoveOutCheck
{
    u32 mahi_flag :1;
    u32 koukanai_flag :1;
    u32 huuin_flag :1;
    u32 meromero_flag :1;
    u32 kanashibari_flag :1;
    u32 chouhatsu_flag :1;
    u32 hirumu_flag  :1;
    u32 konran_flag  :1;
    u32 juuryoku_flag :1;
    u32 healblock_flag :1;
    u32 dummy :22;
};

// so much of this structure sems to be matched in effect_of_moves
struct __attribute__((packed)) battle_moveflag
{
    /* 0x00 */ u32 disabledTurns : 3;
               u32 encoredTurns : 3;
               u32 isCharged : 2;
               u32 tauntTurns : 3;
               u32 protectSuccessTurns : 2;
               u32 perishSongTurns : 2;
               u32 rolloutCount : 3;
               u32 furyCutterCount : 3;
               u32 stockpileCount : 3;
               u32 stockpileDefCount : 3;
               u32 stockpileSpDefCount : 3;
               u32 truantFlag : 1;
               u32 flashFire : 1;

    /* 0x04 */ u32 battlerIdLockOn : 2;
               u32 mimickedMoveIndex : 4;
               u32 battlerIdBinding : 2;
               u32 battlerIdMeanLook : 2;
               u32 lastResortCount : 3;
               u32 magnetRiseTurns : 3;
               u32 healBlockTurns : 3;
               u32 embargoFlag : 3;
               u32 knockOffFlag : 1; // used for unburden
               u32 metronomeTurns : 4;
               u32 boostedAccuracy : 1;
               u32 custapBerryFlag : 1;
               u32 quickClawFlag : 1;
               u32 meFirstFlag : 1;
               u32 : 1;

    /* 0x08 */ int rechargeCount;
    /* 0x0c */ int fakeOutCount;
    /* 0x10 */ int slowStartTurns;
    /* 0x14 */ int meFirstCount;
    /* 0x18 */ int substituteHp;
    /* 0x1c */ u32 transformPid;
    /* 0x20 */ u16 disabledMove;
    /* 0x22 */ u16 bindingMove;
    /* 0x24 */ u16 encoredMove;
    /* 0x26 */ u16 encoredMoveIndex;
    /* 0x28 */ u16 lastResortMoves[4];
    /* 0x2a */ u16 moveNoChoice;
    /* 0x2c */ u16 transformGender;
// padding at 2e
    /* 0x30 */ int itemHpRecover;
}; // size = 0x34

struct __attribute__((packed)) BattlePokemon
{
    /* 0x00 */ u16 species;
    /* 0x02 */ u16 attack;
    /* 0x04 */ u16 defense;
    /* 0x06 */ u16 speed;
    /* 0x08 */ u16 spatk;
    /* 0x0a */ u16 spdef;
    /* 0x0c */ u16 move[4];
    /* 0x14 */ u32 hp_iv : 5;
               u32 atk_iv : 5;
               u32 def_iv : 5;
               u32 spe_iv : 5;
               u32 spatk_iv : 5;
               u32 spdef_iv : 5;
               u32 is_egg : 1;
               u32 have_nickname : 1;
    /* 0x18 */ s8 states[8];
    /* 0x20 */ int weight;
    /* 0x24 */ u8 type1; //25
    /* 0x25 */ u8 type2;
    /* 0x26 */ u8 form_no : 5;
               u8 rare : 1;
               u8 ability; // todo: make abilities have more bits to support values > 256
    /* 0x28 */ u32 appear_check_flag : 1;
               u32 intimidate_flag : 1;
               u32 trace_flag : 1;
               u32 download_flag : 1;
               u32 anticipation_flag : 1;
               u32 forewarn_flag : 1;
               u32 slow_start_flag : 1;
               u32 slow_start_end_flag : 1;
               u32 frisk_flag : 1;
               u32 mold_breaker_flag : 1;
               u32 pressure_flag : 1;
               u32 canMega : 1;
               u32 unnerve_flag : 1;
               u32 dark_aura_flag : 1;
               u32 fairy_aura_flag : 1;
               u32 aura_break_flag : 1;
               u32 sheer_force_flag : 1;
               u32 imposter_flag : 1;
               u32 critical_hits : 2; // tracks the amount of critical hits the pokemon has landed while in battle so far
               u32 air_ballon_flag : 1;
               u32 : 11; // need to add to ClearBattleMonFlags when added to here as well
    /* 0x2c */ u8 pp[4];
    /* 0x30 */ u8 pp_count[4];
    /* 0x34 */ u8 level;
    /* 0x35 */ u8 friend;
    /* 0x36 */ u16 nickname[11];
    /* 0x4c */ s32 hp;
    /* 0x50 */ u32 maxhp;
    /* 0x54 */ u16 oyaname[8];
    // is this where the padding is?
    /* 0x68 */ u32 exp; //68
    /* 0x6c */ u32 personal_rnd;
    /* 0x70 */ u32 condition;
    /* 0x74 */ u32 condition2;
    /* 0x78 */ u32 id_no;
    /* 0x7c */ u16 item;
    /* 0x7e */ u16 dummy;
    /* 0x80 */ u8 hit_count;
    /* 0x81 */ u8 message_flag;
    /* 0x82 */ u8 sex : 4;
               u8 oyasex : 4;
    /* 0x83 */ u8 get_ball;
    /* 0x84 */ u32 effect_of_moves; // think like charge, lock on
    /* 0x88 */ u32 effect_of_moves_temp;
    /* 0x8c */ struct __attribute__((packed)) battle_moveflag moveeffect;
}; // size = 0xc0

typedef struct {
    u32 alloc_size;
    u32 alloc_ofs;
    u16 type;
    u16 conttype;
} __attribute__((packed)) CHAR_MANAGER_ALLOCDATA;

struct __attribute__((packed)) field_condition_count
{

/*0x00*/    u32     weather_count;
/*0x04*/    u8      future_prediction_count[CLIENT_MAX];
/*0x08*/    u8      wish_count[CLIENT_MAX];
/*0x0C*/    u16     future_prediction_wazano[CLIENT_MAX];
/*0x14*/    int     future_prediction_client_no[CLIENT_MAX];
/*0x24*/    s32     future_prediction_damage[CLIENT_MAX];
/*0x34*/    u8      wish_sel_mons[CLIENT_MAX];

};

struct __attribute__((packed)) tcb_skill_intp_work
{
    void *bw;
    struct BattleStruct *sp;
    void *bms;
    void *cap[2];
    void *fop;
    CHAR_MANAGER_ALLOCDATA cma;
    int flag;
    int seq_no;
    int ballID;
    int work[8];
    void *work_p[2];
};

typedef struct
{
    u8  command_code;
    u8  msg_tag;
    u16 msg_id;
    int msg_para[6];
    int msg_keta;
    int msg_client;
} __attribute__((packed)) MESSAGE_PARAM;

struct __attribute__((packed)) side_condition_work
{
    u32     reflectBattler          : 2;
    u32     reflectCount            : 3;
    u32     lightScreenBattler      : 2;
    u32     lightScreenCount        : 3;
    u32     mistBattler             : 2;
    u32     mistCount               : 3;
    u32     safeguardBattler        : 2;
    u32     safeguardCount          : 3;

    u32     konoyubitomare_flag     : 1;
    u32     konoyubitomare_client   : 2;
    u32     knockoff_item           : 6;
    u32     oikaze_count            : 3;

    u32     makibisi_count          : 2;
    u32     dokubisi_count          : 2;
    u32                             :28;
};

struct __attribute__((packed)) BattleAIWorkTable
{
    u8 ai_seq_no; //0x0
    u8 ai_move_pos; //0x1
    u16 ai_move_no; //0x2

    s8 ai_move_point[4]; //0x4

    int ai_calc_work; //0x8
    u32 ai_think_bit; //0xC

    u8 ai_status_flag; //0x10
    u8 ai_think_no; //0x11
    u8 ai_all_move_check_loop_count; //0x12
    u8 ai_all_move_check_push_pos; //0x13

    u8* ai_all_move_check_loop_address; //0x14
    u8 ai_damage_amount[4]; //0x18

    u16 ai_defence_use_move[4][4]; //0x1C, length = 32 = 0x20 bytes

    u8 ai_tokusyu_no[4]; //0x3C
    u16 ai_soubi_item[4]; //0x40

    u16 ai_have_item[2][4]; //0x48, length = 16 = 0x10 bytes

    u32 push_address_buffer[8]; //0x58, length = 32 = 0x20 bytes
    u8 push_address_count; //0x78
    u8 ai_item_count[2]; //0x79
    u8 ai_attack_client; //0x7B
    u8 ai_defence_client; //0x7C

    u8 ai_item_type[2]; //0x7D
    u8 ai_item_condition[2]; //0x7F

    u8 padding_81; //implicit padding here, one byte

    u16 ai_item_no[2]; //0x82

    u8 ai_dir_select_client[CLIENT_MAX]; //0x86
    struct BattleMove old_moveTbl[467 + 1]; //0x8A, length = 0x10*468 = 0x1D40, this technically is also 0x3DE in the BattleStruct

    u16 padding_1DCA; //implicit padding here, two bytes

    ITEMDATA *item; //0x1DCC, this is technically also 0x2120 in the BattleStruct

    u16 ai_calc_count[CLIENT_MAX]; //0x1DD0
    u16 ai_calc_continue[CLIENT_MAX]; //0x1DD8

    //length is 0x1DE0
    //the end of this struct is at 0x2134 in the BattleStruct
};


struct __attribute__((packed)) BattleStruct
{
    /*0x0*/ u8 com_seq_no[CLIENT_MAX];
    /*0x4*/ u8 ret_seq_no[CLIENT_MAX];
    /*0x8*/ int server_seq_no;
    /*0xC*/ int next_server_seq_no;
    /*0x10*/ int fcc_seq_no;
    /*0x14*/ int fcc_work;
    /*0x18*/ int pcc_seq_no;
    /*0x1C*/ int pcc_work;
    /*0x20*/ int scc_seq_no;
    /*0x24*/ int scc_work;
    /*0x28*/ int sba_seq_no;
    /*0x2C*/ int sba_work;
    /*0x30*/ int swhac_seq_no;
    /*0x34*/ int swhac_work;
    /*0x38*/ int swoam_type;
    /*0x3C*/ int swoam_seq_no;
    /*0x40*/ int swoak_seq_no;
    /*0x44*/ int swoak_work;
    /*0x48*/ int wb_seq_no;
    /*0x4c*/ int woc_seq_no;
    /*0x50*/ int ssc_seq_no;
    /*0x54*/ int stc_seq_no;
    /*0x58*/ int switch_in_check_seq_no;
    /*0x5C*/ int svc_work;

    /*0x60*/ int waza_seq_adrs;
    /*0x64*/ int attack_client;
    /*0x68*/ int attack_client_temp;
    /*0x6C*/ int defence_client;
    /*0x70*/ int defence_client_temp;
    /*0x74*/ int fainting_client;
    /*0x78*/ int reshuffle_client;
    /*0x7C*/ int reshuffle_client_temp;
    /*0x80*/ int ability_client;
    /*0x84*/ int magic_cort_client;

    /*0x88*/ int addeffect_type;
    /*0x8C*/ int addeffect_param;
    /*0x90*/ int addeffect_flag;

    /*0x94*/ int state_client;
    /*0x98*/ int push_client;
    /*0x9C*/ int obtained_exp;
    /*0xA0*/ int exp_share_obtained_exp;
    /*0xA4*/ u32 obtained_exp_right_flag[2];
    /*0xAC*/ int skill_arc_kind;
    /*0xB0*/ int skill_arc_index;
    /*0xB4*/ int skill_seq_no;
    /*0xB8*/ int push_count;
    /*0xBC*/ int push_skill_arc_kind[4];
    /*0xCC*/ int push_skill_arc_index[4];
    /*0xDC*/ int push_skill_seq_no[4];
    /*0xEC*/ int agi_cnt;
    /*0xF0*/ int wait_cnt;
    /*0xF4*/ MESSAGE_PARAM mp;
    /*0x118*/ int client_work;
    /*0x11C*/ int attack_client_work;
    /*0x120*/ int defence_client_work;
    /*0x124*/ int waza_work;
    /*0x128*/ int item_work;
    /*0x12C*/ int tokusei_work;
    /*0x130*/ int msg_work;
    /*0x134*/ int calc_work;
    /*0x138*/ int temp_work;
    /*0x13C*/ u32 client_status[CLIENT_MAX];
    /*0x14C*/ u32 koban_counter;
    /*0x150*/ int total_turn;
    /*0x154*/ int total_hinshi[CLIENT_MAX];
    /*0x164*/ int total_damage[CLIENT_MAX];
    /*0x174*/ int me_first_total_turns;
    /*0x178*/ struct tcb_skill_intp_work *tciw;
    /*0x17C*/ void *work;
    /*0x180*/ u32 field_condition;
    /*0x184*/ struct field_condition_count fcc;
    /*0x1BC*/ u32 side_condition[2];
    /*0x1C4*/ struct side_condition_work scw[2];
    /*0x1D4*/ struct OneTurnEffect oneTurnFlag[4];
    /*0x2D4*/ struct OneSelfTurnEffect oneSelfFlag[4];
    /*0x344*/ struct MoveOutCheck moveOutCheck[4];

    /*0x354*/ struct BattleAIWorkTable aiWorkTable;
    /*0x2134*/ u32 *ai_seq_work;
    /*0x2138*/ u32 ai_seq_address;

    /*0x213C*/ u32 server_status_flag;
    /*0x2140*/ u32 server_status_flag2;
    /*0x2144*/ int damage;
    /*0x2148*/ int hit_damage;
    /*0x214C*/ int critical_count;
    /*0x2150*/ int critical;
    /*0x2154*/ int damage_power;
    /*0x2158*/ int damage_value;
    /*0x215C*/ int hp_calc_work;
    /*0x2160*/ int move_type;
    /*0x2164*/ int waza_eff_cnt;
    /*0x2168*/ int money_multiplier;
    /*0x216C*/ u32 waza_status_flag;

    /*0x2170*/ u32 add_status_flag_direct;
    /*0x2174*/ u32 add_status_flag_indirect;
    /*0x2178*/ u32 add_status_flag_tokusei;
    /*0x217C*/ u8 multi_hit_count;
    /*0x217D*/ u8 multi_hit_count_temp;
    /*0x217E*/ u8 client_loop;
    /*0x217F*/ u8 beat_up_count;

    /*0x2180*/ u32 loop_flag;
    /*0x2184*/ u32 waza_out_check_on_off;
    /*0x2188*/ u32 loop_hit_check;

    /*0x218C*/ u32 condition2_off_req[CLIENT_MAX];
    /*0x219C*/ u8 sel_mons_no[CLIENT_MAX];
    /*0x21A0*/ u8 reshuffle_sel_mons_no[CLIENT_MAX];
    /*0x21A4*/ u8 ai_reshuffle_sel_mons_no[CLIENT_MAX];
    /*0x21A8*/ u32 client_act_work[4][4];
    /*0x21E8*/ u8 client_agi_work[4];
    /*0x21EC*/ u8 turn_order[4];
    /*0x21F0*/ u32 psp_agi_point[4];
    /*0x2200*/ u8 ServerQue[4][4][16];
    /*0x2300*/ u8 server_buffer[4][256];
    /*0x2700*/ int SkillSeqWorkOld[400];
    /*0x2D40*/ struct BattlePokemon battlemon[CLIENT_MAX]; //0xc0
    /*0x3040*/ u32 waza_no_temp;
    /*0x3044*/ u32 current_move_index;
    // u8 unk_bytes4[0x74];

    /*0x3048*/ u32 waza_no_last;
    /*0x304C*/ u32 waza_no_keep[CLIENT_MAX];

    /*0x305C*/ u16 waza_no_mamoru[CLIENT_MAX];
    /*0x3064*/ u16 waza_no_hit[CLIENT_MAX];
    /*0x306C*/ u16 waza_no_hit_client[CLIENT_MAX];
    /*0x3074*/ u16 waza_no_hit_type[CLIENT_MAX];
    /*0x307C*/ u16 waza_no_old[CLIENT_MAX];
    /*0x3084*/ u16 waza_no_oumu[CLIENT_MAX];
    /*0x308C*/ u16 waza_no_oumu_hit[CLIENT_MAX][CLIENT_MAX];
    /*0x30AC*/ u16 waza_no_sketch[CLIENT_MAX];
    /*0x30B4*/ u16 waza_no_select[CLIENT_MAX];

    /*0x30BC*/ u16 waza_no_pos[CLIENT_MAX];
    /*0x30C4*/ //u8 unk_bytes_4[0x44];
    /*0x    */ u16 waza_no_texture2[CLIENT_MAX];
    /*0x    */ u16 waza_no_texture2_client[CLIENT_MAX];
    /*0x    */ u16 waza_no_texture2_type[CLIENT_MAX];
    /*0x    */ u16 waza_no_metronome[CLIENT_MAX];

    /*0x    */ int store_damage[CLIENT_MAX];

    /*0x    */ int client_no_hit[CLIENT_MAX];

    /*0x    */ int client_no_agi;

    /*0x3108*/ u8 no_reshuffle_client;
    /*0x3109*/ u8 level_up_pokemon;
    /*0x310A*/ u16 que_check_wait;
    /*0x310C*/ u16 agi_rand[CLIENT_MAX];
    /*0x3114*/ int nagetsukeru_work;
    /*0x3118*/ int nagetsukeru_seq_no;
    /*0x311C*/ u8 safari_get_count;
    /*0x311D*/ u8 safari_escape_count;
    /*0x311E*/ u8 escape_count;
    /*0x311F*/ u8 fight_end_flag;

    /*0x3120*/ u8 magnitude;
    /*0x3121*/ u8 weather_check_flag;
    /*0x3122*/ s16 hp_temp;

    /*0x3124*/ u16 recycle_item[CLIENT_MAX];
    /*0x312C*/ u8 list_row[4][6];
    /*0x3144*/ int jingle_flag;
    /*0x3148*/ int server_queue_time_out;
    /*0x314C*/ u8 rec_select_flag[4];
    /*0x3150*/ int client_working_count;
    /*0x3154*/ u32 battle_progress_flag : 1;
               u32 : 31;
    /*0x3158*/ u8 log_hail_for_ice_face; // bitfield with 1 << client for if there was hail last turn
    /*0x3159*/ u8 tailwindCount[2]; // new tailwind counter
    /*0x315B*/ u8 mons_getting_exp;
    /*0x315C*/ u8 mons_getting_exp_from_item;
    /*0x315D*/ u8 padding_315D[0x21]; // padding to get moveTbl to 317E (for convenience of 3180 in asm)
    /*0x317E*/ struct BattleMove moveTbl[NUM_OF_MOVES + 1];
    /*0x    */ u32 gainedExperience[6]; // possible experience gained per party member in order to get level scaling done right
    /*0x    */ u32 gainedExperienceShare[6]; // possible experience gained per party member in order to get level scaling done right
    /*0x    */ int SkillSeqWork[600];
    /*...*/
};

enum
{
    CHECK_PLAYER_SIDE_ALL = 0,
    CHECK_PLAYER_SIDE_ALIVE,
    CHECK_ENEMY_SIDE_ALL,
    CHECK_ENEMY_SIDE_ALIVE,
    CHECK_ALL_BATTLER_ALIVE = 8,
};

enum
{
    BATTLE_MON_DATA_SPECIES,
    BATTLE_MON_DATA_ATK,
    BATTLE_MON_DATA_DEF,
    BATTLE_MON_DATA_SPE,
    BATTLE_MON_DATA_SPATK,
    BATTLE_MON_DATA_SPDEF,
    BATTLE_MON_DATA_MOVE_1,
    BATTLE_MON_DATA_MOVE_2,
    BATTLE_MON_DATA_MOVE_3,
    BATTLE_MON_DATA_MOVE_4,
    BATTLE_MON_DATA_HP_RND,
    BATTLE_MON_DATA_ATK_RND,
    BATTLE_MON_DATA_DEF_RND,
    BATTLE_MON_DATA_SPD_RND,
    BATTLE_MON_DATA_SPATK_RND,
    BATTLE_MON_DATA_SPDEF_RND,
    BATTLE_MON_DATA_IS_EGG,
    BATTLE_MON_DATA_IS_NICKNAMED,
    BATTLE_MON_DATA_STATE_HP,
    BATTLE_MON_DATA_STATE_ATK,
    BATTLE_MON_DATA_STATE_DEF,
    BATTLE_MON_DATA_STATE_SPE,
    BATTLE_MON_DATA_STATE_SPATK,
    BATTLE_MON_DATA_STATE_SPDEF,
    BATTLE_MON_DATA_STATE_ACCURACY,
    BATTLE_MON_DATA_STATE_EVASIVENESS,
    BATTLE_MON_DATA_ABILITY,
    BATTLE_MON_DATA_TYPE1,
    BATTLE_MON_DATA_TYPE2,
    BATTLE_MON_DATA_SEX,
    BATTLE_MON_DATA_LEVEL = 43,
    BATTLE_MON_DATA_HP = 47,
    BATTLE_MON_DATA_MAX_HP,
    BATTLE_MON_DATA_MAX_CONDITION = 52,
    BATTLE_MON_DATA_STATUS2 = 53,
    BATTLE_MON_HELD_ITEM = 55,
    BATTLE_MON_DATA_MOVE_STATE = 59,  //0x40 - fly, 0x80 - dig
    BATTLE_MON_DATA_MOVE_STATE_2 = 60,//0x40 - fly, 0x80 - dig
    BATTLE_MON_FLASH_FIRE_ACTIVATED = 73,
    BATTLE_MON_DATA_SLOW_START_COUNTER = 89,
};

#define MEGA_NEED 1
#define MEGA_CHECK_APPER 2
#define MEGA_NO_NEED 0

struct __attribute__((packed)) newBattleStruct
{
    u8 SideMega[2];//检查双方是否mega过,0我方,1敌方
    u8 playerWantMega;
    u8 PlayerMegaed;
    u8 needMega[4];//需要mega

    CATS_ACT_PTR MegaOAM;
    CATS_ACT_PTR MegaButton;
    CATS_ACT_PTR WeatherOAM;
    SysTask *weatherUpdateTask;
    u32 weather;
    u8 MegaIconLight;
    u8 ChangeBgFlag:4;
    u8 CanMega:4;
};

#include "pokemon.h"

struct __attribute__((packed)) POKEPARTY {
    int PokeCountMax;
    int PokeCount;
    struct PartyPokemon member[6];
};

typedef struct {
    u16 sentence_type;
    u16 sentence_id;
    u16 word[2];
} __attribute__((packed)) PMS_DATA; // size: 8 bytes

typedef struct {
    u8 data_type;
    u8 tr_type;
    u8 tr_gra;
    u8 poke_count;

    u16 use_item[4];

    u32 aibit;
    u32 fight_type;

    u16 name[8];
    PMS_DATA win_word;
    PMS_DATA lose_word;
} __attribute__((packed)) TRAINER_DATA; // size: 52 bytes

struct __attribute__((packed)) BATTLE_PARAM
{
    /*0x0000*/  u32 fight_type;
    /*0x0004*/  struct POKEPARTY *poke_party[4];
    /*0x0008*/  int win_lose_flag;
    /*0x000C*/  int trainer_id[4];
    /*0x001C*/  TRAINER_DATA trainer_data[4]; //0xD0 bytes
    /*0x00EC*/  u8 fill[0xD4];
    /*0x01C0*/  void* savedata;
};


struct __attribute__((packed)) FULL_TRAINER_MON_DATA_STRUCTURE // structure isn't actually used as the structure is iterated through conditionally
{
    /* 0x0 */ u8 ivs;
    /* 0x1 */ u8 abilityslot;
    /* 0x2 */ u16 level;
    /* 0x4 */ u16 monsno;
    /* 0x6 */ u16 itemno;
    /* 0x8 */ u16 moves[4];
    /* 0x10 */ u16 ability;
    /* 0x12 */ u16 ball;
    /* 0x14 */ u8 ivnums[6];
    /* 0x1A */ u8 evnums[6];
    /* 0x20 */ u8 nature;
    /* 0x21 */ u8 shinylock;
    /* 0x22 */ u8 padding[2]; // ?
    /* 0x24 */ u32 additionalflags;
    /* 0x28 */ u32 status;
    /* 0x2C */ u16 hp;
    /* 0x2E */ u16 atk;
    /* 0x30 */ u16 def;
    /* 0x32 */ u16 speed;
    /* 0x34 */ u16 spatk;
    /* 0x36 */ u16 spdef;
    /* 0x38 */ u8 types[2];
    /* 0x3A */ u8 ppcounts[4];
    /* 0x3E */ u16 nickname[11];
    /* 0x54 */ u16 custom;
}; // size - 0x56

struct __attribute__((packed)) CLIENT_PARAM
{
    /*0x0000*/ u8 filler1[0x94];
    /*0x0094*/ u8 client_buffer[256];
    /*0x0194*/ u8 client_no;
    /*0x0195*/ u8 client_type;
};

struct __attribute__((packed)) POKEMON_ENCOUNT_PARAM
{
    u8 command_code;
    u8 sex:2;
    u8 rare:1;
    u8 form_no:5;
    u16 monsno;
    u32 personal_rnd;
    int voice;
    u16 wazano[4];
    u16 pp[4];
    u16 ppmax[4];
    u16 nickname[11];
};

struct __attribute__((packed)) POKEMON_APPEAR_PARAM
{
    u8 command_code;
    u8 sex:2;
    u8 rare:1;
    u8 form_no:5;
    u16 monsno;
    u32 personal_rnd;
    int voice;
    int sel_mons_no;
    int ballID;
    int flag;
    u16 wazano[4];
    u16 pp[4];
    u16 ppmax[4];
    u16 nickname[11];
    int pair_sel_mons_no;
    int migawari_flag;
    u16 wep_mons_no[CLIENT_MAX];
    u8 wep_sex[CLIENT_MAX];
    u8 wep_rare[CLIENT_MAX];
    u8 wep_form_no[CLIENT_MAX];
    u32 wep_personal_rnd[CLIENT_MAX];
};

struct __attribute__((packed)) ILLUSION_STRUCT
{
    u16 illusionNameBuf[2][12]; // at least get this hword aligned
    u8 isSideInIllusion[2];
    u8 illusionPos[2];
};

