#ifndef BATTLE_H
#define BATTLE_H

#include "types.h"
#include "item.h"
#include "sprite.h"
#include "pokemon.h"
#include "task.h"
#include "save.h"
#include "constants/moves.h"

#define CLIENT_MAX 4

#define TYPE_NORMAL    0
#define TYPE_FIGHTING  1
#define TYPE_FLYING    2
#define TYPE_POISON    3
#define TYPE_GROUND    4
#define TYPE_ROCK      5
#define TYPE_BUG       6
#define TYPE_GHOST     7
#define TYPE_STEEL     8
#define TYPE_MYSTERY   9
#define TYPE_FAIRY     9 // TODO: 17
#define TYPE_FIRE     10
#define TYPE_WATER    11
#define TYPE_GRASS    12
#define TYPE_ELECTRIC 13
#define TYPE_PSYCHIC  14
#define TYPE_ICE      15
#define TYPE_DRAGON   16
#define TYPE_DARK     17
#define TYPE_TYPELESS 18
#define TYPE_STELLAR  19 // TODO: 99

#define NUMBER_OF_MON_TYPES 20

// Type effectiveness
#define TYPE_MUL_NO_EFFECT       0
#define TYPE_MUL_NOT_EFFECTIVE   5
#define TYPE_MUL_NORMAL          10
#define TYPE_MUL_SUPER_EFFECTIVE 20

// Special type table IDs
#define TYPE_FORESIGHT 0xFE
#define TYPE_ENDTABLE  0xFF

// Contest types
#define COOL   0
#define BEAUTY 1
#define CUTE   2
#define SMART  3
#define TOUGH  4

#define SELECT_FIGHT_COMMAND 1
#define SELECT_ITEM_COMMAND 2
#define SELECT_POKEMON_COMMAND 3
#define SELECT_ESCAPE_COMMAND 4


// add effect defines
#define ADD_STATUS_NO_ABILITY (0x08000000)

#define ADD_EFFECT_DIRECT 1
#define ADD_EFFECT_INDIRECT 2
#define ADD_EFFECT_ABILITY 3
#define ADD_EFFECT_MOVE_EFFECT 4
#define ADD_EFFECT_HELD_ITEM 5

#define BATTLE_STATUS_FLAT_HIT_RATE                 (1 << 10)
#define BATTLE_STATUS_IGNORE_TYPE_EFFECTIVENESS     (1 << 11)
#define BATTLE_STATUS_CRASH_DAMAGE                  (1 << 12)
#define BATTLE_STATUS_MOVE_SUCCESSFUL               (1 << 13)
#define BATTLE_STATUS_MOVE_ANIMATIONS_OFF           (1 << 14)
#define BATTLE_STATUS_IGNORE_TYPE_IMMUNITY          (1 << 15)
#define BATTLE_STATUS_MULTI_HIT_IGNORE_MESSAGE      (1 << 16)
#define BATTLE_STATUS_FAIL_STAT_STAGE_CHANGE        (1 << 17)
#define BATTLE_STATUS_MISS_MESSAGE                  (1 << 18)
#define BATTLE_STATUS_SHADOW_FORCE                  (1 << 19)
#define BATTLE_STATUS_NO_MOVE_SET                   (1 << 20)
#define BATTLE_STATUS_MESSAGES_OFF                  (1 << 21)
#define BATTLE_STATUS_SECONDARY_EFFECT              (1 << 22)
#define BATTLE_STATUS_MOLD_BREAKER                  (1 << 23)
#define BATTLE_STATUS_FAINTED                       (15 << 24)
#define BATTLE_STATUS_SELFDESTRUCTED                (15 << 28)

#define BATTLE_STATUS_FAINTED_SHIFT                 24
#define BATTLE_STATUS_SELFDESTRUCTED_SHIFT          28

//Battle Status 2
#define BATTLE_STATUS2_NO_EXP_GAINED                (1 << 0)
#define BATTLE_STATUS2_UPDATE_STAT_STAGES           (1 << 1)
#define BATTLE_STATUS2_DISPLAY_ATTACK_MESSAGE       (1 << 2)
#define BATTLE_STATUS2_MAGIC_COAT                   (1 << 3)
#define BATTLE_STATUS2_UTURN                        (1 << 4)
#define BATTLE_STATUS2_FIRST_DAMAGE_MESSAGE         (1 << 5)
#define BATTLE_STATUS2_MOVE_SUCCEEDED               (1 << 6)
#define BATTLE_STATUS2_STAT_STAGE_CHANGE_SHOWN      (1 << 7)
#define BATTLE_STATUS2_RECOVER_HP_VISUAL            (1 << 8)
#define BATTLE_STATUS2_20                           (1 << 20)
#define BATTLE_STATUS2_FORM_CHANGE                  (1 << 26)
#define BATTLE_STATUS2_RECALC_MON_STATS             (1 << 27)
#define BATTLE_STATUS2_EXP_GAIN                     (15 << 28)

#define BATTLE_STATUS2_EXP_GAIN_SHIFT               28

//Struggle Checks
#define STRUGGLE_CHECK_NO_MOVES             (1 << 0)
#define STRUGGLE_CHECK_NO_PP                (1 << 1)
#define STRUGGLE_CHECK_DISABLED             (1 << 2)
#define STRUGGLE_CHECK_TORMENT              (1 << 3)
#define STRUGGLE_CHECK_TAUNT                (1 << 4)
#define STRUGGLE_CHECK_IMPRISON             (1 << 5)
#define STRUGGLE_CHECK_GRAVITY              (1 << 6)
#define STRUGGLE_CHECK_HEAL_BLOCK           (1 << 7)
#define STRUGGLE_CHECK_ENCORE               (1 << 8) //unused because they straight up forgot
#define STRUGGLE_CHECK_CHOICED              (1 << 9)
#define STRUGGLE_CHECK_GORILLA_TACTICS      (1 << 10)
#define STRUGGLE_CHECK_GIGATON_HAMMER       (1 << 11)
#define STRUGGLE_CHECK_ASSAULT_VEST         (1 << 12)

/**
 *  @brief msg work specifically for statuses
 */
enum
{
    MSG_HEAL_SLEEP = 0,
    MSG_HEAL_POISON,
    MSG_HEAL_BURN,
    MSG_HEAL_PARALYSIS,
    MSG_HEAL_FROZEN,
};


/**
 *  @brief structure for move data dumped to BattleStruct's moveTbl
 */
struct __attribute__((packed)) BattleMove
{
    /* 0x0 */ u16 effect;      /**< battle effect script to run */
    /* 0x2 */ u8 split;        /**< move category for physical/special split */
    /* 0x3 */ u8 power;        /**< move base power */

    /* 0x4 */ u8 type;         /**< move type */
    /* 0x5 */ u8 accuracy;     /**< move accuracy, 0 is always-hit or has separate accuracy calc */
    /* 0x6 */ u8 pp;           /**< base move power points */
    /* 0x7 */ u8 secondaryEffectChance; /**< % chance that the move's secondary effect happens */

    /* 0x8 */ u16 target;      /**< target bitfield for the move */
    /* 0xA */ s8 priority;     /**< move priority */
    /* 0xB */ u8 flag;         /**< various flags for the move, see FLAG_* constants */
    /* 0xC */ u8 unk[4];       /**< battle effect script to run */
}; // size = 0x10

/**
 *  @brief effects to track across one turn
 */
struct __attribute__((packed)) OneTurnEffect
{
    /* 0x00 */ u32 struggle_flag : 1;     /**< pokémon struggled this turn */
               u32 pp_dec_flag : 1;       /**< pp decreased this turn? */
               u32 mamoru_flag : 1;
               u32 helping_hand_flag : 1; /**< pokémon is being aided by helping hand */
               u32 magic_cort_flag : 1;   /**< pokémon has magic coat active */
               u32 snatchFlag : 1;
               u32 haneyasume_flag : 1;
               u32 escape_flag : 2;
               u32 prevent_one_hit_ko_ability : 1; /**< pokémon has damp active */
               // begin custom flags
               enum ForceExecutionOrder{EXECUTION_ORDER_NORMAL, EXECUTION_ORDER_AFTER_YOU, EXECUTION_ORDER_QUASH} forceExecutionOrderFlag : 2;
               u32 parental_bond_flag : 2;
               u32 parental_bond_is_active : 1;
               u32 rampageProcessedFlag : 1;
               u32 chargeProcessedFlag : 1;
               u32 numberOfKOs : 3;
               u32 pendingFocusPunchFlag : 1;
               u32 : 11;

    /* 0x04 */ int physical_damage[4];    /**< [don't use] physical damage as indexed by battler.  Counter doesn't use this, use OneSelfTurnEffect's physical_damage (sp->oneSelfFlag[battler].physical_damage) */
    /* 0x14 */ int physical_damager;      /**< [don't use] last battler that physically damaged this pokémon.  Counter doesn't use this, use OneSelfTurnEffect's physical_damager (sp->oneSelfFlag[battler].physical_damager) */
    /* 0x18 */ int physical_damager_bit;  /**< [don't use] No2Bit of physical_damager */
    /* 0x1C */ int special_damage[4];     /**< [don't use] special damage as indexed by battler.  Mirror Coat doesn't use this, use OneSelfTurnEffect's special_damage (sp->oneSelfFlag[battler].special_damage) */
    /* 0x2C */ int special_damager;       /**< [don't use] last battler that specially damaged this pokémon.  Mirror Coat doesn't use this, use OneSelfTurnEffect's special_damager (sp->oneSelfFlag[battler].special_damager) */
    /* 0x30 */ int special_damager_bit;   /**< [don't use] No2Bit of special_damager */
    /* 0x34 */ int last_damage;           /**< [don't use] last damage that was taken.  still use OneSelfTurnEffect field */
    /* 0x38 */ int last_damager;          /**< [don't use] last battler that damaged this pokémon.  still use OneSelfTurnEffect field */
    /* 0x3C */ int dameoshi_damage;
}; // size = 0x40

/**
 *  @brief effects to track across one turn that seems to actually be better used
 */
struct __attribute__((packed)) OneSelfTurnEffect
{
    /* 0x00 */ u32 no_pressure_flag : 1;         /**< affected by pressure */
               u32 lightningRodFlag : 1;       /**< lightning rod activated on this pokémon */
               u32 stormDrainFlag : 1;         /**< storm drain activated on this pokémon */
               u32 moldBreakerFlag : 1;        /**< mold breaker activated on this pokémon */
               u32 trickRoomFlag : 1;           /**< trick room is active on this pokémon */
               u32 prevent_one_hit_ko_item : 1;  /**< a held item prevented OHKO on this pokémon */
               u32 rolloutCount : 3;           /**< counter for rollout */
               u32 defiant_flag : 1;             /**< flag that signals to activate defiant after a stat is raised */
               u32 : 22;

    /* 0x04 */ int physical_damage;              /**< physical damage last taken */
    /* 0x08 */ int physical_damager;             /**< last battler that physically damaged this pokémon */
    /* 0x0C */ int special_damage;               /**< special damage last taken */
    /* 0x10 */ int special_damager;              /**< last battler that specially damaged this pokémon */
    /* 0x14 */ int status_flag;
    /* 0x18 */ int shell_bell_damage;            /**< damage basis to be used for shell bell */
}; // size = 0x1C

/**
 *  @brief a structure that tracks various reasons that a pokémon did not move after the main bits tracking them have been cleared
 */
struct __attribute__((packed)) MoveOutCheck
{
    /* 0x0 */ u32 stoppedFromParalysis :1;    /**< pokémon could not move due to paralysis */
              u32 stoppedFromIneffective :1;  /**< pokémon could not move due to its move being entirely ineffective */
              u32 stoppedFromImprison :1;     /**< pokémon could not move due to imprison */
              u32 stoppedFromAttract :1;      /**< pokémon could not move due to attract */
              u32 stoppedFromDisable :1;      /**< pokémon could not move due to disable */
              u32 stoppedFromTaunt :1;        /**< pokémon could not move due to taunt */
              u32 stoppedFromFlinch :1;       /**< pokémon could not move because it flinched */
              u32 stoppedFromConfusion :1;    /**< pokémon could not move due to hitting itself in confusion */
              u32 stoppedFromGravity :1;      /**< pokémon could not move due to gravity bringing it to the ground */
              u32 stoppedFromHealBlock :1;    /**< pokémon could not move due to heal block preventing the move */
              u32 dummy :22;
}; // size = 0x4

/**
 *  @brief a structure that tracks various things regarding moves for each pokémon.  largely a bitfield copy of effect_of_moves, but what is actually checked for to *enforce* each effect
 *
 *  stored as moveeffect in each BattlePokemon structure
 */
struct __attribute__((packed)) battle_moveflag
{
    /* 0x00 */ u32 disabledTurns : 3;        /**< duration of disable */
               u32 encoredTurns : 3;         /**< duration of encore */
               u32 isCharged : 2;            /**< whether or not the pokémon is charged */
               u32 tauntTurns : 3;           /**< duration of taunt */
               u32 protectSuccessTurns : 2;  /**< how many times protect has succeeded */
               u32 perishSongTurns : 2;      /**< perish song count */
               u32 rolloutCount : 3;         /**< rollout count */
               u32 furyCutterCount : 3;      /**< fury cutter successes */
               u32 stockpileCount : 3;       /**< stockpile count */
               u32 stockpileDefCount : 3;    /**< amount of defense stages due to stockpile */
               u32 stockpileSpDefCount : 3;  /**< amount of special defense stages due to stockpile */
               u32 truantFlag : 1;           /**< truant active flag */
               u32 flashFire : 1;            /**< flash fire active flag */

    /* 0x04 */ u32 battlerIdLockOn : 2;      /**< which battler the pokémon is locked on to */
               u32 mimickedMoveIndex : 4;    /**< which move was mimicked as index to its move array */
               u32 battlerIdBinding : 2;     /**< which battler the pokémon is binding */
               u32 battlerIdMeanLook : 2;    /**< which battler the pokémon is trapping */
               u32 lastResortCount : 3;      /**< how many moves have been used so far for last resort */
               u32 magnetRiseTurns : 3;      /**< magnet rise duration */
               u32 healBlockTurns : 3;       /**< heal block duration */
               u32 embargoFlag : 3;          /**< embargo duration */
               u32 knockOffFlag : 1;         /**< if the pokémon has lost its item.  used for unburden */
               u32 metronomeTurns : 4;       /**< how many turns the metronome item has run for */
               u32 boostedAccuracy : 1;      /**< accuracy boosted flag, see Micle Berry */
               u32 custapBerryFlag : 1;      /**< whether the custap berry has activated */
               u32 quickClawFlag : 1;        /**< whether the quick claw activated */
               u32 meFirstFlag : 1;          /**< whether the move me first was used */
               u32 : 1;

    /* 0x08 */ int rechargeCount;            /**< recharge duration */
    /* 0x0c */ int fakeOutCount;             /**< can it use fake out? */
    /* 0x10 */ int slowStartTurns;           /**< slow start duration */
    /* 0x14 */ int meFirstCount;             /**< me first count */
    /* 0x18 */ int substituteHp;             /**< amount of hp the active substitute has */
    /* 0x1c */ u32 transformPid;             /**< pid stored for transform */
    /* 0x20 */ u16 disabledMove;             /**< move that was disabled */
    /* 0x22 */ u16 bindingMove;              /**< move that is binding the opponent */
    /* 0x24 */ u16 encoredMove;              /**< move that is forced by encore */
    /* 0x26 */ u16 encoredMoveIndex;         /**< move position that is forced by encore in the pokémon's move array */
    /* 0x28 */ u16 lastResortMoves[4];       /**< which moves have been used for last resort purposes */
    /* 0x2a */ u16 moveNoChoice;             /**< move number forced by choice item */
    /* 0x2c */ u16 transformGender;          /**< pokémon sex stored for transform purposes */
// padding at 2e
    /* 0x30 */ int itemHpRecover;            /**< how much hp was just restored by an item */
}; // size = 0x34


/**
 *  @brief in-battle representation of a PartyPokemon
 *
 *  not encrypted or anything, has a number of fields pertaining to each mon on the field
 */
struct __attribute__((packed)) BattlePokemon
{
    /* 0x00 */ u16 species;                  /**< species */
    /* 0x02 */ u16 attack;                   /**< raw attack stat */
    /* 0x04 */ u16 defense;                  /**< raw defense stat */
    /* 0x06 */ u16 speed;                    /**< raw speed stat */
    /* 0x08 */ u16 spatk;                    /**< raw special attack stat */
    /* 0x0a */ u16 spdef;                    /**< raw special defense stat */
    /* 0x0c */ u16 move[4];                  /**< move indices the BattlePokemon knows */
    /* 0x14 */ u32 hp_iv : 5;                /**< hp iv */
               u32 atk_iv : 5;               /**< attack iv */
               u32 def_iv : 5;               /**< defense iv */
               u32 spe_iv : 5;               /**< speed iv */
               u32 spatk_iv : 5;             /**< special attack iv */
               u32 spdef_iv : 5;             /**< special defense iv */
               u32 is_egg : 1;               /**< the BattlePokemon is an egg */
               u32 have_nickname : 1;        /**< has a nickname */
    /* 0x18 */ s8 states[8];                 /**< stat stages */
    /* 0x20 */ int weight;                   /**< current weight (before multiplicative adjustments but after autotomize adjustments) */
    /* 0x24 */ u8 type1; //25                /**< first type */
    /* 0x25 */ u8 type2;                     /**< second type */
    /* 0x26 */ u8 form_no : 5;               /**< form id */
               u8 rare : 1;                  /**< shininess */
               u8 ability;                   /**< ability index */

               /** switch in flags to mark it as having been done */
    /* 0x28 */ u32 paddingForNow1 : 6;
               u32 slow_start_flag : 1;      /**< slow start has printed its message */
               u32 slow_start_end_flag : 1;  /**< slow start should end */
               u32 paddingForNow2 : 3;
               u32 canMega : 1;              /**< the BattlePokemon can mega */
               u32 sheer_force_flag : 1;     /**< keep track of sheer force activation */
               u32 imposter_flag : 1;        /**< imposter has activated */
               u32 critical_hits : 2;        /**< tracks the amount of critical hits the pokémon has landed while in battle so far */
               u32 air_balloon_flag : 1;      /**< the held air balloon has printed its message */
               u32 potentially_affected_by_psychic_terrain_move_used_flag : 1;
               u32 ability_activated_flag : 1;
               u32 tera_type : 5;
               u32 is_currently_terastallized : 1;
               u32 is_currently_dynamaxed : 1;
               u32 has_dynamaxed_before : 1; /**< for Cherrim and Flower Gift */
               u32 type3 : 5; // need to add to ClearBattleMonFlags when added to here as well
    /* 0x2c */ u8 pp[4];                     /**< move pp left */
    /* 0x30 */ u8 pp_count[4];               /**< move max pp */
    /* 0x34 */ u8 level;                     /**< current level */
    /* 0x35 */ u8 friendship;                /**< friendship */
    /* 0x36 */ u16 nickname[11];             /**< nickname characters.  see charmap.txt for more information */
    /* 0x4c */ s32 hp;                       /**< current hp */
    /* 0x50 */ u32 maxhp;                    /**< max hp */
    /* 0x54 */ u16 oyaname[8];               /**< OT name */
    /* 0x68 */ u32 exp; //68                 /**< total experience */
    /* 0x6c */ u32 personal_rnd;             /**< personality id */
    /* 0x70 */ u32 condition;                /**< non-volatile status conditions (STATUS_* constants) */ // status
    /* 0x74 */ u32 condition2;               /**< most other status conditions (STATUS2_* constants) */  // status2
    /* 0x78 */ u32 id_no;                    /**< OT ID */
    /* 0x7c */ u16 item;                     /**< held item */
    /* 0x7e */ u16 dummy;
    /* 0x80 */ u8 hit_count;
    /* 0x81 */ u8 message_flag;
    /* 0x82 */ u8 sex : 4;                   /**< sex for rivalry purposes etc. */
               u8 oyasex : 4;                /**< original trainer sex */
    /* 0x83 */ u8 get_ball;                  /**< caught ball */
    /* 0x84 */ u32 effect_of_moves;          /**< move effect trackers (see MOVE_EFFECT_* constants) */ // moveEffectFlags
    /* 0x88 */ u32 effect_of_moves_temp;     /**< storage for effect_of_moves */
    /* 0x8c */ struct __attribute__((packed)) battle_moveflag moveeffect;   // unk88
}; // size = 0xc0

typedef struct {
    u32 alloc_size;
    u32 alloc_ofs;
    u16 type;
    u16 conttype;
} __attribute__((packed)) CHAR_MANAGER_ALLOCDATA;


/**
 *  @brief weather/other field condition tracker
 */
struct __attribute__((packed)) field_condition_count
{
    /*0x00*/ u32     weather_count;                            /**< weather duration left */
    /*0x04*/ u8      future_prediction_count[CLIENT_MAX];      /**< future turns left */
    /*0x08*/ u8      wish_count[CLIENT_MAX];                   /**< wish turns left */
    /*0x0C*/ u16     future_prediction_wazano[CLIENT_MAX];     /**< move to use for future sight damage (future sight or doom desire?) */
    /*0x14*/ int     future_prediction_client_no[CLIENT_MAX];  /**< target to use for future sight damage */
    /*0x24*/ s32     future_prediction_damage[CLIENT_MAX];     /**< damage to use for future sight */
    /*0x34*/ u8      wish_sel_mons[CLIENT_MAX];                /**< party position to use to restore wish */
};

struct __attribute__((packed)) tcb_skill_intp_work
{
    void *bw;
    struct BattleStruct *sp;
    void *bms;
    void *cap[2];
    void *fop;
    CHAR_MANAGER_ALLOCDATA cma;
    int flag;
    int seq_no;
    int ballID;
    int work[8];
    void *work_p[2];
};

typedef struct
{
    u8  command_code;
    u8  msg_tag;
    u16 msg_id;
    int msg_para[6];
    int msg_keta;
    int msg_client;
} __attribute__((packed)) MESSAGE_PARAM;

struct __attribute__((packed)) side_condition_work
{
    u32     reflectBattler          : 2;
    u32     reflectCount            : 3;
    u32     lightScreenBattler      : 2;
    u32     lightScreenCount        : 3;
    u32     mistBattler             : 2;
    u32     mistCount               : 3;
    u32     safeguardBattler        : 2;
    u32     safeguardCount          : 3;

    u32     followMeFlag            : 1;
    u32     battlerIdFollowMe       : 2;
    u32     knockoff_item           : 6;
    u32     oikaze_count            : 3;

    u32     spikesLayers            : 2;
    u32     toxicSpikesLayers       : 2;
    u32                             :28;
};

struct __attribute__((packed)) BattleAIWorkTable
{
    u8 ai_seq_no; //0x0
    u8 ai_move_pos; //0x1
    u16 ai_move_no; //0x2

    s8 ai_move_point[4]; //0x4

    int ai_calc_work; //0x8
    u32 ai_think_bit; //0xC

    u8 ai_status_flag; //0x10
    u8 ai_think_no; //0x11
    u8 ai_all_move_check_loop_count; //0x12
    u8 ai_all_move_check_push_pos; //0x13

    u8* ai_all_move_check_loop_address; //0x14
    u8 ai_damage_amount[4]; //0x18

    u16 ai_defence_use_move[4][4]; //0x1C, length = 32 = 0x20 bytes

    u8 ai_tokusyu_no[4]; //0x3C
    u16 ai_soubi_item[4]; //0x40

    u16 ai_have_item[2][4]; //0x48, length = 16 = 0x10 bytes

    u32 push_address_buffer[8]; //0x58, length = 32 = 0x20 bytes
    u8 push_address_count; //0x78
    u8 ai_item_count[2]; //0x79
    u8 ai_attack_client; //0x7B
    u8 ai_defence_client; //0x7C

    u8 ai_item_type[2]; //0x7D
    u8 ai_item_condition[2]; //0x7F

    u8 padding_81; //implicit padding here, one byte

    u16 ai_item_no[2]; //0x82

    u8 ai_dir_select_client[CLIENT_MAX]; //0x86
    struct BattleMove old_moveTbl[467 + 1]; //0x8A, length = 0x10*468 = 0x1D40, this technically is also 0x3DE in the BattleStruct

    u16 padding_1DCA; //implicit padding here, two bytes

    ITEMDATA *item; //0x1DCC, this is technically also 0x2120 in the BattleStruct

    u16 ai_calc_count[CLIENT_MAX]; //0x1DD0
    u16 ai_calc_continue[CLIENT_MAX]; //0x1DD8

    //length is 0x1DE0
    //the end of this struct is at 0x2134 in the BattleStruct
};


enum TerrainOverlayType {
    TERRAIN_NONE,
    GRASSY_TERRAIN,
    MISTY_TERRAIN,
    ELECTRIC_TERRAIN,
    PSYCHIC_TERRAIN
};

/**
 *  @brief structure that tracks the terrain type currently present
 */
typedef struct {
    u8 type; /**< TerrainOverlayType enum */
    u8 numberOfTurnsLeft;
} TerrainOverlay;


typedef enum BattleSelectState {
    SSI_STATE_SELECT_COMMAND_INIT,
    SSI_STATE_1,
    SSI_STATE_2,
    SSI_STATE_3,
    SSI_STATE_4,
    SSI_STATE_5,
    SSI_STATE_6,
    SSI_STATE_7,
    SSI_STATE_8,
    SSI_STATE_9,
    SSI_STATE_10,
    SSI_STATE_11,
    SSI_STATE_12,
    SSI_STATE_13,
    SSI_STATE_14,
    SSI_STATE_15,
    SSI_STATE_NO_MOVES,
    SSI_STATE_END
} BattleSelectState;


/**
 *  @brief enum for command field from BattleStruct
 */
typedef enum ControllerCommand {
    CONTROLLER_COMMAND_GET_BATTLE_MON,
    CONTROLLER_COMMAND_START_ENCOUNTER,
    CONTROLLER_COMMAND_TRAINER_MESSAGE,
    CONTROLLER_COMMAND_SEND_OUT,
    CONTROLLER_COMMAND_SELECTION_SCREEN_INIT,
    CONTROLLER_COMMAND_SELECTION_SCREEN_INPUT,
    CONTROLLER_COMMAND_CALC_EXECUTION_ORDER,
    CONTROLLER_COMMAND_BEFORE_TURN,
    CONTROLLER_COMMAND_8,
    CONTROLLER_COMMAND_UPDATE_FIELD_CONDITION,
    CONTROLLER_COMMAND_UPDATE_MON_CONDITION, //10
    CONTROLLER_COMMAND_UPDATE_FIELD_CONDITION_EXTRA,
    CONTROLLER_COMMAND_TURN_END,
    CONTROLLER_COMMAND_FIGHT_INPUT,
    CONTROLLER_COMMAND_ITEM_INPUT,
    CONTROLLER_COMMAND_POKEMON_INPUT, //15
    CONTROLLER_COMMAND_RUN_INPUT,
    CONTROLLER_COMMAND_SAFARI_THROW_BALL,
    CONTROLLER_COMMAND_SAFARI_THROW_BAIT,
    CONTROLLER_COMMAND_SAFARI_THROW_MUD,
    CONTROLLER_COMMAND_SAFARI_WATCHING, //20
    CONTROLLER_COMMAND_CATCHING_CONSTEST_THROW_BALL,
    CONTROLLER_COMMAND_RUN_SCRIPT,
    CONTROLLER_COMMAND_23,
    CONTROLLER_COMMAND_24,
    CONTROLLER_COMMAND_25,
    CONTROLLER_COMMAND_26,
    CONTROLLER_COMMAND_27,
    CONTROLLER_COMMAND_HP_CALC,
    CONTROLLER_COMMAND_29,
    CONTROLLER_COMMAND_30,
    CONTROLLER_COMMAND_31,
    CONTROLLER_COMMAND_32,
    CONTROLLER_COMMAND_33,
    CONTROLLER_COMMAND_34,
    CONTROLLER_COMMAND_35,
    CONTROLLER_COMMAND_36,
    CONTROLLER_COMMAND_37,
    CONTROLLER_COMMAND_38,
    CONTROLLER_COMMAND_39,
    CONTROLLER_COMMAND_40,
    CONTROLLER_COMMAND_41,
    CONTROLLER_COMMAND_42,
    CONTROLLER_COMMAND_43,
    CONTROLLER_COMMAND_44,
    CONTROLLER_COMMAND_45,
    CONTROLLER_COMMAND_MAX
} ControllerCommand;

enum BattleControlSequence {
    BATTLE_CONTROL_GET_BATTLE_MON = 0,
    BATTLE_CONTROL_START_ENCOUNTER,
    BATTLE_CONTROL_TRAINER_MESSAGE,
    BATTLE_CONTROL_SHOW_BATTLE_MON,
    BATTLE_CONTROL_INIT_COMMAND_SELECTION,
    BATTLE_CONTROL_COMMAND_SELECTION_INPUT,
    BATTLE_CONTROL_CALC_TURN_ORDER,
    BATTLE_CONTROL_CHECK_PRE_MOVE_ACTIONS,
    BATTLE_CONTROL_BRANCH_ACTIONS,
    BATTLE_CONTROL_CHECK_FIELD_CONDITIONS,
    BATTLE_CONTROL_CHECK_MON_CONDITIONS,
    BATTLE_CONTROL_CHECK_SIDE_CONDITIONS,
    BATTLE_CONTROL_TURN_END,

    BATTLE_CONTROL_FIGHT,
    BATTLE_CONTROL_ITEM,
    BATTLE_CONTROL_PARTY,
    BATTLE_CONTROL_RUN,

    BATTLE_CONTROL_SAFARI_BALL,
    BATTLE_CONTROL_SAFARI_BAIT,
    BATTLE_CONTROL_SAFARI_ROCK,
    BATTLE_CONTROL_SAFARI_WAIT,

    BATTLE_CONTROL_EXEC_SCRIPT,
    BATTLE_CONTROL_BEFORE_MOVE,
    BATTLE_CONTROL_TRY_MOVE,
    BATTLE_CONTROL_PRIMARY_EFFECT,
    BATTLE_CONTROL_MOVE_FAILED,
    BATTLE_CONTROL_USE_MOVE,
    BATTLE_CONTROL_UPDATE_HP,
    BATTLE_CONTROL_AFTER_MOVE_MESSAGE,
    // 29 is an unused state
    BATTLE_CONTROL_AFTER_MOVE_EFFECT = 30,
    BATTLE_CONTROL_LOOP_MULTI_HIT,
    // 32 is an unused state
    BATTLE_CONTROL_LOOP_FAINTED = 33,
    BATTLE_CONTROL_LOOP_SPREAD_MOVES,
    BATTLE_CONTROL_FAINT_AFTER_SELFDESTRUCT,
    BATTLE_CONTROL_TRIGGER_AFTER_HIT_EFFECTS,
    // 37 is an unused state
    BATTLE_CONTROL_UPDATE_MOVE_BUFFERS = 38,
    BATTLE_CONTROL_MOVE_END,
    BATTLE_CONTROL_CHECK_ANY_FAINTED,
    BATTLE_CONTROL_RESULT,
    BATTLE_CONTROL_SCREEN_WIPE,
    BATTLE_CONTROL_FIGHT_END,
    BATTLE_CONTROL_END_WAIT,
};

typedef enum FutureConditionType {
    FUTURE_CONDITION_NONE = 0,
    FUTURE_CONDITION_WISH,
    FUTURE_CONDITION_FUTURE_SIGHT_OR_DOOM_DESIRE,
    FUTURE_CONDITION_MAX = FUTURE_CONDITION_FUTURE_SIGHT_OR_DOOM_DESIRE,
} FutureConditionType;

// Cannonade, Vine Lash, Volcalith, Wildfire) and Pledge Sea of Fire
typedef enum SideConditionType {
    SIDE_CONDITION_NONE = 0,
    SIDE_CONDITION_G_MAX_VINE_LASH,
    SIDE_CONDITION_G_MAX_CANNONADE,
    SIDE_CONDITION_G_MAX_WILDFIRE,
    SIDE_CONDITION_G_MAX_VOLCALITH,
    SIDE_CONDITION_SEA_OF_FIRE,
    SIDE_CONDITION_MAX = SIDE_CONDITION_SEA_OF_FIRE,
} SideConditionType;

typedef union ConditionType
{
    FutureConditionType futureConditionType;
    SideConditionType sideConditionType;
} ConditionType;

typedef struct FutureCondition {
    ConditionType conditionType;
    u8 affectedClient;
} FutureCondition;

typedef struct OnceOnlyAbilityFlags {
    BOOL battleBondFlag;
    BOOL intrepidSwordFlag;
    BOOL dauntlessShieldFlag;
    BOOL superSweetSyrupFlag;
} OnceOnlyAbilityFlags;

#define BATTLE_SCRIPT_PUSH_DEPTH 4

/**
 *  @brief the entire battle structure that we are interested in (for the most part)
 *
 *  tracks everything about battle state.  consider it a "battle global" structure
 */
struct PACKED BattleStruct {
    /*0x0*/ u8 com_seq_no[CLIENT_MAX];
    /*0x4*/ u8 ret_seq_no[CLIENT_MAX];
    /*0x8*/ int server_seq_no;
    /*0xC*/ int next_server_seq_no;
    /*0x10*/ int fcc_seq_no;
    /*0x14*/ int fcc_work;
    /*0x18*/ int stateUpdateMonCondition;
    /*0x1C*/ int updateMonConditionData;
    /*0x20*/ int scc_seq_no;
    /*0x24*/ int scc_work;
    /*0x28*/ int sba_seq_no;
    /*0x2C*/ int sba_work;
    /*0x30*/ int swhac_seq_no;
    /*0x34*/ int swhac_work;
    /*0x38*/ int swoam_type;
    /*0x3C*/ int swoam_seq_no;
    /*0x40*/ int swoak_seq_no;
    /*0x44*/ int swoak_work;
    /*0x48*/ int wb_seq_no;
    /*0x4c*/ int woc_seq_no;
    /*0x50*/ int ssc_seq_no;
    /*0x54*/ int stc_seq_no;
    /*0x58*/ int switch_in_check_seq_no;
    /*0x5C*/ int svc_work;

    /*0x60*/ int waza_seq_adrs;
    /*0x64*/ int attack_client;
    /*0x68*/ int attack_client_temp;
    /*0x6C*/ int defence_client;
    /*0x70*/ int defence_client_temp;
    /*0x74*/ int fainting_client;       // battlerIdFainted
    /*0x78*/ int reshuffle_client;      // battlerIdSwitch
    /*0x7C*/ int reshuffle_client_temp;
    /*0x80*/ int ability_client;
    /*0x84*/ int magic_cort_client;     // battlerIdMagicCoat

    /*0x88*/ int addeffect_type;
    /*0x8C*/ int addeffect_param;
    /*0x90*/ int addeffect_flag;

    /*0x94*/ int state_client;
    /*0x98*/ int push_client;
    /*0x9C*/ int obtained_exp;
    /*0xA0*/ int exp_share_obtained_exp;
    /*0xA4*/ u32 obtained_exp_right_flag[2];
    /*0xAC*/ int skill_arc_kind;
    /*0xB0*/ int skill_arc_index;
    /*0xB4*/ int skill_seq_no;
    /*0xB8*/ int push_count;
    /*0xBC*/ int push_skill_arc_kind[BATTLE_SCRIPT_PUSH_DEPTH];
    /*0xCC*/ int push_skill_arc_index[BATTLE_SCRIPT_PUSH_DEPTH];
    /*0xDC*/ int push_skill_seq_no[BATTLE_SCRIPT_PUSH_DEPTH];
    /*0xEC*/ int executionIndex;
    /*0xF0*/ int wait_cnt;
    /*0xF4*/ MESSAGE_PARAM mp;          // buffMsg
    /*0x118*/ int battlerIdTemp;          // battlerIdTemp
    /*0x11C*/ int attack_client_work;   // battlerIdLeechSeedRecv
    /*0x120*/ int defence_client_work;  // battlerIdLeechSeeded
    /*0x124*/ int waza_work;            // moveTemp
    /*0x128*/ int item_work;            // itemTemp
    /*0x12C*/ int tokusei_work;         // abilityTemp
    /*0x130*/ int msg_work;             // msgTemp
    /*0x134*/ int calc_work;            // calcTemp
    /*0x138*/ int temp_work;            // tempData
    /*0x13C*/ u32 client_status[CLIENT_MAX];
    /*0x14C*/ u32 koban_counter;
    /*0x150*/ int total_turn;
    /*0x154*/ int total_hinshi[CLIENT_MAX];
    /*0x164*/ int total_damage[CLIENT_MAX];
    /*0x174*/ int me_first_total_turns;
    /*0x178*/ struct tcb_skill_intp_work *tciw;
    /*0x17C*/ void *work;
    /*0x180*/ u32 field_condition;                                  // fieldCondition
    /*0x184*/ struct field_condition_count fcc;                     // fieldConditionData
    /*0x1BC*/ u32 side_condition[2];                                // fieldSideConditionFlags
    /*0x1C4*/ struct side_condition_work scw[2];                    // fieldSideConditionData
    /*0x1D4*/ struct OneTurnEffect oneTurnFlag[CLIENT_MAX];         // turnData
    /*0x2D4*/ struct OneSelfTurnEffect oneSelfFlag[CLIENT_MAX];     // selfTurnData
    /*0x344*/ struct MoveOutCheck moveOutCheck[CLIENT_MAX];         // MoveFail

    /*0x354*/ struct BattleAIWorkTable aiWorkTable;
    /*0x2134*/ u32 *ai_seq_work;
    /*0x2138*/ u32 ai_seq_address;

    /*0x213C*/ u32 server_status_flag;                              // battleStatus
    /*0x2140*/ u32 server_status_flag2;                             // battleStatus2
    /*0x2144*/ int damage;
    /*0x2148*/ int hit_damage;
    /*0x214C*/ int critical_count;                                  // criticalCnt
    /*0x2150*/ int critical;                                        // criticalMultiplier
    /*0x2154*/ int damage_power;
    /*0x2158*/ int damage_value;
    /*0x215C*/ int hp_calc_work;                                    // hpCalc
    /*0x2160*/ int move_type;                                       // moveType
    /*0x2164*/ int waza_eff_cnt;
    /*0x2168*/ int money_multiplier;
    /*0x216C*/ u32 waza_status_flag;                                // moveStatusFlag

    /*0x2170*/ u32 add_status_flag_direct;
    /*0x2174*/ u32 add_status_flag_indirect;
    /*0x2178*/ u32 add_status_flag_tokusei;
    /*0x217C*/ u8 multiHitCount;
    /*0x217D*/ u8 multiHitCountTemp;
    /*0x217E*/ u8 client_loop;
    /*0x217F*/ u8 beat_up_count;

    /*0x2180*/ u32 loop_flag;
    /*0x2184*/ u32 waza_out_check_on_off; // multiHitCheckFlags
    /*0x2188*/ u32 loop_hit_check;  // checkMultiHit

    /*0x218C*/ u32 condition2_off_req[CLIENT_MAX];
    /*0x219C*/ u8 sel_mons_no[CLIENT_MAX];  // selectedMonIndex
    /*0x21A0*/ u8 reshuffle_sel_mons_no[CLIENT_MAX];
    /*0x21A4*/ u8 ai_reshuffle_sel_mons_no[CLIENT_MAX];
    /*0x21A8*/ u32 playerActions[4][4]; // client_act_work
    /*0x21E8*/ u8 executionOrder[4]; // client_agi_work -- accounts for running, items, etc used in battler slots
    /*0x21EC*/ u8 turnOrder[4]; // turn_order -- by pokemon speed, accounting for trick room
    /*0x21F0*/ u32 effectiveSpeed[4]; // psp_agi_point
    /*0x2200*/ u8 ServerQue[4][4][16];
    /*0x2300*/ u8 server_buffer[4][256];
    /*0x2700*/ int SkillSeqWorkOld[400];
    /*0x2D40*/ struct BattlePokemon battlemon[CLIENT_MAX]; //0xc0
    /*0x3040*/ u32 moveNoTemp;
    /*0x3044*/ u32 current_move_index;
    // u8 unk_bytes4[0x74];

    /*0x3048*/ u32 waza_no_last;
    /*0x304C*/ u32 waza_no_keep[CLIENT_MAX];

    /*0x305C*/ u16 waza_no_mamoru[CLIENT_MAX];
    /*0x3064*/ u16 waza_no_hit[CLIENT_MAX];
    /*0x306C*/ u16 waza_no_hit_client[CLIENT_MAX];
    /*0x3074*/ u16 waza_no_hit_type[CLIENT_MAX];
    /*0x307C*/ u16 waza_no_old[CLIENT_MAX];
    /*0x3084*/ u16 waza_no_oumu[CLIENT_MAX];
    /*0x308C*/ u16 waza_no_oumu_hit[CLIENT_MAX][CLIENT_MAX];
    /*0x30AC*/ u16 waza_no_sketch[CLIENT_MAX];
    /*0x30B4*/ u16 waza_no_select[CLIENT_MAX];

    /*0x30BC*/ u16 waza_no_pos[CLIENT_MAX];
    /*0x30C4*/ //u8 unk_bytes_4[0x44];
    /*0x30C4*/ u16 waza_no_texture2[CLIENT_MAX];
    /*0x30CC*/ u16 waza_no_texture2_client[CLIENT_MAX];
    /*0x30D4*/ u16 waza_no_texture2_type[CLIENT_MAX];
    /*0x30DC*/ u16 waza_no_metronome[CLIENT_MAX];
    /*0x30E4*/ int store_damage[CLIENT_MAX];
    /*0x30F4*/ int client_no_hit[CLIENT_MAX];
    /*0x3104*/ int client_no_agi;
    /*0x3108*/ u8 no_reshuffle_client;      // switchInFlag
    /*0x3109*/ u8 level_up_pokemon;
    /*0x310A*/ u16 que_check_wait;
    /*0x310C*/ u16 agi_rand[CLIENT_MAX];
    /*0x3114*/ int nagetsukeru_work;
    /*0x3118*/ int nagetsukeru_seq_no;
    /*0x311C*/ u8 safari_get_count;
    /*0x311D*/ u8 safari_escape_count;
    /*0x311E*/ u8 escape_count;
    /*0x311F*/ u8 fight_end_flag;

    /*0x3120*/ u8 magnitude;
    /*0x3121*/ u8 weather_check_flag;
    /*0x3122*/ s16 hp_temp;

    /*0x3124*/ u16 recycle_item[CLIENT_MAX];
    /*0x312C*/ u8 list_row[4][6];
    /*0x3144*/ int jingle_flag;
    /*0x3148*/ int server_queue_time_out;
    /*0x314C*/ u8 rec_select_flag[4];
    /*0x3150*/ int client_working_count;
    /*0x3154*/ u32 battle_progress_flag : 1;
               u32 : 31;
    /*0x3158*/ u8 log_hail_for_ice_face; // bitfield with 1 << client for if there was hail last turn
    /*0x3159*/ u8 tailwindCount[2]; // new tailwind counter
    /*0x315B*/ u8 mons_getting_exp;
    /*0x315C*/ u8 mons_getting_exp_from_item;
    /*0x315D*/ u8 relic_song_tracker; // bitfield with 1 << client for if it used relic song
    /*0x315E*/ u8 frisk_tracker; // see which clients have been frisked by the frisk client (1 << client)
    /*0x315F*/ u8 magicBounceTracker; // if any client has already activated magic bounce, another can not activate
    /*0x3160*/ u8 binding_turns[4]; // turns left for bind
    /*0x3164*/ u8 entryHazardQueue[2][NUM_HAZARD_IDX];
    /*0x316E*/ u8 hazardQueueTracker:7;
               u8 itemActivatedTracker:1; // if an item that isn't lost on activation has been activated for this hit (think rocky helmet)
    /*0x316F*/ u8 padding_316F[0x317E - 0x316F]; // padding to get moveTbl to 317E (for convenience of 3180 in asm)
    /*0x317E*/ struct BattleMove moveTbl[NUM_OF_MOVES + 1];
    /*0x    */ u32 gainedExperience[6]; // possible experience gained per party member in order to get level scaling done right
    /*0x    */ u32 gainedExperienceShare[6]; // possible experience gained per party member in order to get level scaling done right
    /*0x    */ int SkillSeqWork[600];
    /*...*/

               FutureCondition futureConditionQueue[CLIENT_MAX * FUTURE_CONDITION_MAX];
               BOOL checkOnlySpecifiedTarget; // for BattleFormChangeCheck
               u8 endTurnEventBlockSequenceNumber;
               u8 checkOnlySpecifiedTargetClient;

               TerrainOverlay terrainOverlay; // realign this to u32 boundary lol
               u8 printed_field_message;
               u8 original_terrain:7;
               u8 hasLoadedTerrainOver:1;
               u8 original_bgId:7;
               u8 hasLoadedBgIdOver:1;
               u32 moveStatusFlagForSpreadMoves[CLIENT_MAX];
               u32 damageForSpreadMoves[CLIENT_MAX]; // u32 or int?
               u8 clientLoopForSpreadMoves;
               BOOL boostedAccuracy;
               BOOL moveStolen;
               BOOL moveBounced;
               u8 rawSpeedNonRNGClientOrder[CLIENT_MAX];
               int numberOfTurnsClientHasCurrentAbility[CLIENT_MAX]; // idk it's probably not u8?
               u8 clientPriority[CLIENT_MAX];
               OnceOnlyAbilityFlags onceOnlyAbilityFlags[4][6];
};

enum {
    SPREAD_MOVE_LOOP_ALLY = 0,
    SPREAD_MOVE_LOOP_OPPONENT_LEFT,
    SPREAD_MOVE_LOOP_OPPONENT_RIGHT,
    SPREAD_MOVE_LOOP_MAX = SPREAD_MOVE_LOOP_OPPONENT_RIGHT
};

typedef struct GROUND_WORK {
    void *unk0;
    struct BattleSystem *bw;
    u8 team;
    u8 terrain;
    s16 x;
    s16 y;
    u16 unused;
} GROUND_WORK; //size: 0x10

typedef struct {
    u16 sentence_type;
    u16 sentence_id;
    u16 word[2];
} PACKED PMS_DATA; // size: 8 bytes

typedef struct {
    u8 data_type;
    u8 tr_type;
    u8 tr_gra;
    u8 poke_count;

    u16 use_item[4];

    u32 aibit;
    u32 fight_type;

    u16 name[8];
    PMS_DATA win_word;
    PMS_DATA lose_word;
} PACKED TRAINER_DATA; // size: 52 bytes


struct BattleSystem {
    /* 0x00 */ u32 *unk0;
    /* 0x04 */ void * /*BgConfig **/ bgConfig;
    /* 0x08 */ void * /*Window **/ window;
    /* 0x0C */ u32 *unkC;
    /* 0x10 */ u32 *unk10;
    /* 0x14 */ u32 *msgFormat;
    /* 0x18 */ void * /*String **/ msgBuffer;
    /* 0x1C */ u32 unk1C;
    /* 0x20 */ u32 unk20;
    /* 0x24 */ u32 unk24;
    /* 0x28 */ void * /*PaletteData **/ palette;
    /* 0x2C */ u32 battleType;
    /* 0x30 */ struct BattleStruct *sp;
    /* 0x34 */ void * /*OpponentData **/ opponentData[4];
    /* 0x38 */ int maxBattlers;
    struct PlayerProfile *playerProfile[4];
    void *bag;
    void *bagCursor;
    void *pokedex;
    void *storage;
    struct Party *trainerParty[4];
    void *chatotVoice[4];
    u32 *unk88;
    u32 *unk8C;
    void *unk90;
    void *unk94;
    u32 *unk98;
    u32 *unk9C;
    u16 trainerId[4];
    u8 trainerGender[4];
    TRAINER_DATA trainers[4];
    GROUND_WORK ground[2];
    // u32 *unk19C;
    // u32 *unk1A0[2];
    // FontID *hpFont;
    // FontID *levelFont;
    // void *msgIcon;
    // Options *options;
    // u32 *unk1B8;
    // void *unk1BC;
    // u32 *unk1C0;
    // u32 *unk1C4;
    // void *unk1C8; //related to animations
    // u32 *unk1CC;
    // UnkBattleSystemSub1D0 unk1D0[4];
    // UnkBattleSystemSub220 unk220;
    // GAME_STATS *gameStats;
    u8 padding_19C[0x220 - 0x19C]; // 220 based on assembly at 0223B884
    u8 *bg_area;
    u16 *pal_area;
    // u8 sendBuffer[0x1000];
    // u8 recvBuffer[0x1000];
    // u16 unk2238[0x70];
    // u16 unk2318[0x70];
    // u16 unk23E8; //labeling may be wrong before here
    // u16 unk23EA;
    // u16 unk23EC;
    // u16 unk23EE;
    // u16 unk23F0;
    // u16 unk23F2;
    // u8 *unk23F4;
    // u8 *unk23F8;
    // u8 unk23FC;
    // u8 unk23FD;
    // u8 unk23FE;
    // u8 unk240F_0:1;
    // u8 unk240F_1:1;
    // u8 unk240E_F:1;
    // u8 criticalHpMusic:2;
    // u8 criticalHpMusicDelay:3;
    u8 padding[0x2400 - 0x228];
    u32 terrain;
    u32 bgId;
    // int location;
    // u32 battleSpecial;
    // int timezone; //might be timeOfDay? unclear
    // int safariBallCnt;
    // u8 unk2418[4];
    // u32 unk241C;
    // u8 battleOutcomeFlag;
    // u8 unk2421;
    // u16 unk2422;
    // int unk2424;
    // int unk2428;
    // int weather;
    // int unk2430;
    // u32 unk2434;
    // int unk2438;
    // int unk243C;
    // int unk2440;
    // u8 unk2442;
    // u8 unk2445;
    // u16 unk2446;
    // u32 rand;
    // u32 randTemp;
    // u16 unk244C[4];
    // u16 unk2454[4];
    // u16 unk245C[4];
    // int unk2464[4];
    // u32 unk2474_0:1,
    //     unk2474_1:1,
    //     unk2474_2:1,
    //     unk2474_3:1,
    //     unk2474_4:28;
    // u32 unk2478;
    // SysTask *unk247C;
    // u8 chatotVoiceParam[4];
    // u32 unk2488;
    // u8 unk248C[4];
};


//Ability Checks - values for flag for CheckSideAbility
#define CHECK_ABILITY_SAME_SIDE             0
#define CHECK_ABILITY_SAME_SIDE_HP          1
#define CHECK_ABILITY_OPPOSING_SIDE         2
#define CHECK_ABILITY_OPPOSING_SIDE_HP      3
#define CHECK_ABILITY_OPPOSING_SIDE_HP_RET  4
#define CHECK_ABILITY_ALL                   5
#define CHECK_ABILITY_ALL_NOT_USER          6
#define CHECK_ABILITY_ALL_NOT_USER_RET      7
#define CHECK_ABILITY_ALL_HP                8
#define CHECK_ABILITY_ALL_HP_NOT_USER       9

enum
{
    BATTLE_MON_DATA_SPECIES,
    BATTLE_MON_DATA_ATK,
    BATTLE_MON_DATA_DEF,
    BATTLE_MON_DATA_SPE,
    BATTLE_MON_DATA_SPATK,
    BATTLE_MON_DATA_SPDEF,
    BATTLE_MON_DATA_MOVE_1,
    BATTLE_MON_DATA_MOVE_2,
    BATTLE_MON_DATA_MOVE_3,
    BATTLE_MON_DATA_MOVE_4,
    BATTLE_MON_DATA_HP_RND,
    BATTLE_MON_DATA_ATK_RND,
    BATTLE_MON_DATA_DEF_RND,
    BATTLE_MON_DATA_SPD_RND,
    BATTLE_MON_DATA_SPATK_RND,
    BATTLE_MON_DATA_SPDEF_RND,
    BATTLE_MON_DATA_IS_EGG,
    BATTLE_MON_DATA_IS_NICKNAMED,
    BATTLE_MON_DATA_STATE_HP,
    BATTLE_MON_DATA_STATE_ATK,
    BATTLE_MON_DATA_STATE_DEF,
    BATTLE_MON_DATA_STATE_SPE,
    BATTLE_MON_DATA_STATE_SPATK,
    BATTLE_MON_DATA_STATE_SPDEF,
    BATTLE_MON_DATA_STATE_ACCURACY,
    BATTLE_MON_DATA_STATE_EVASIVENESS,
    BATTLE_MON_DATA_ABILITY,
    BATTLE_MON_DATA_TYPE1,
    BATTLE_MON_DATA_TYPE2,
    BATTLE_MON_DATA_SEX,
    BATTLE_MON_DATA_LEVEL = 43,
    BATTLE_MON_DATA_HP = 47,
    BATTLE_MON_DATA_MAX_HP,
    BATTLE_MON_DATA_MAX_CONDITION = 52,
    BATTLE_MON_DATA_STATUS2 = 53,
    BATTLE_MON_HELD_ITEM = 55,
    BATTLE_MON_DATA_MOVE_STATE = 59,  //0x40 - fly, 0x80 - dig
    BATTLE_MON_DATA_MOVE_STATE_2 = 60,//0x40 - fly, 0x80 - dig
    BATTLE_MON_FLASH_FIRE_ACTIVATED = 73,
    BATTLE_MON_DATA_SLOW_START_COUNTER = 89,
};

#define BATTLE_MON_HAS_TYPE(sp, client, type) (sp->battlemon[client].type1 == type || sp->battlemon[client].type2 == type)

#define MEGA_NEED 1
#define MEGA_CHECK_APPER 2
#define MEGA_NO_NEED 0

struct PACKED newBattleStruct
{
    u8 SideMega[4];//检查双方是否mega过,0我方,1敌方
    u8 needMega[4];//需要mega
    u8 playerWantMega;
    u8 PlayerMegaed;
    u8 MegaIconLight;
    u8 ChangeBgFlag:4;
    u8 CanMega:4;

    CATS_ACT_PTR MegaOAM;
    CATS_ACT_PTR MegaButton;
    CATS_ACT_PTR WeatherOAM;
    SysTask *weatherUpdateTask;

#ifdef RESTORE_ITEMS_AT_BATTLE_END
    u16 itemsToRestore[6]; // items that each mon was holding at the beginning of the battle
#endif // RESTORE_ITEMS_AT_BATTLE_END
};

struct PACKED BATTLE_PARAM
{
    /*0x0000*/  u32 fight_type;
    /*0x0004*/  struct Party *poke_party[4];
    /*0x0008*/  int win_lose_flag;
    /*0x000C*/  int trainer_id[4];
    /*0x001C*/  TRAINER_DATA trainer_data[4]; //0xD0 bytes
    /*0x00EC*/  u8 fill[0xD4];
    /*0x01C0*/  void* savedata;
};


struct PACKED FULL_TRAINER_MON_DATA_STRUCTURE // structure isn't actually used as the structure is iterated through conditionally
{
    /* 0x00 */ u8 ivs;
    /* 0x01 */ u8 abilityslot;
    /* 0x02 */ u16 level;
    /* 0x04 */ u16 monsno;
    /* 0x06 */ u16 itemno;
    /* 0x08 */ u16 moves[4];
    /* 0x10 */ u16 ability;
    /* 0x12 */ u16 ball;
    /* 0x14 */ u8 ivnums[6];
    /* 0x1A */ u8 evnums[6];
    /* 0x20 */ u8 nature;
    /* 0x21 */ u8 shinylock;
    /* 0x22 */ u8 padding[2]; // ?
    /* 0x24 */ u32 additionalflags;
    /* 0x28 */ u32 status;
    /* 0x2C */ u16 hp;
    /* 0x2E */ u16 atk;
    /* 0x30 */ u16 def;
    /* 0x32 */ u16 speed;
    /* 0x34 */ u16 spatk;
    /* 0x36 */ u16 spdef;
    /* 0x38 */ u8 types[2];
    /* 0x3A */ u8 ppcounts[4];
    /* 0x3E */ u16 nickname[11];
    /* 0x54 */ u16 custom;
}; // size = 0x56

struct __attribute__((packed)) CLIENT_PARAM
{
    /*0x0000*/ u8 filler1[0x94];
    /*0x0094*/ u8 client_buffer[256];
    /*0x0194*/ u8 client_no;
    /*0x0195*/ u8 client_type;
};

struct __attribute__((packed)) POKEMON_ENCOUNT_PARAM
{
    u8 command_code;
    u8 sex:2;
    u8 rare:1;
    u8 form_no:5;
    u16 monsno;
    u32 personal_rnd;
    int voice;
    u16 wazano[4];
    u16 pp[4];
    u16 ppmax[4];
    u16 nickname[11];
};

struct __attribute__((packed)) POKEMON_APPEAR_PARAM
{
    u8 command_code;
    u8 sex:2;
    u8 rare:1;
    u8 form_no:5;
    u16 monsno;
    u32 personal_rnd;
    int voice;
    int sel_mons_no;
    int ballID;
    int flag;
    u16 wazano[4];
    u16 pp[4];
    u16 ppmax[4];
    u16 nickname[11];
    int pair_sel_mons_no;
    int migawari_flag;
    u16 wep_mons_no[CLIENT_MAX];
    u8 wep_sex[CLIENT_MAX];
    u8 wep_rare[CLIENT_MAX];
    u8 wep_form_no[CLIENT_MAX];
    u32 wep_personal_rnd[CLIENT_MAX];
};

struct __attribute__((packed)) ILLUSION_STRUCT
{
    u16 illusionNameBuf[4][12]; // at least get this hword aligned
    u8 illusionPos[4];
    u8 illusionClient[4];
    u8 isSideInIllusion;
};

