#ifndef POKEMON_H
#define POKEMON_H

#include "config.h"
//#include "save.h"
#include "types.h"
#include "trainer_data.h"

#define _PARTY_MENU_WINDOW_ID_MAX 40
#define _PARTY_MENU_SPRITE_ID_MAX 29

#define POKEMON_GENDER_MALE 0
#define POKEMON_GENDER_FEMALE 1
#define POKEMON_GENDER_UNKNOWN 2

#define MONS_MALE       (0)
#define MONS_FEMALE     (254)
#define MONS_UNKNOWN    (255)

// MON_DATA_RESERVED_113 (2 bits) fields
#define DUMMY_P2_1_HIDDEN_ABILITY_MASK (0x01)
#define DUMMY_P2_1_HAS_HIT_NECESSARY_CRITICAL_HITS (0x02)

// MON_DATA_RESERVED_114 (16 bits) fields
#define DUMMY_P2_2_CHANGE_ABILITY_SLOT (0x0001)
#define DUMMY_P2_2_NATURE_OVERRIDE (0x003E)
#define DUMMY_P2_2_HP_IV_OVERRIDE (0x0040)
#define DUMMY_P2_2_ATTACK_IV_OVERRIDE (0x0080)
#define DUMMY_P2_2_DEFENSE_IV_OVERRIDE (0x0100)
#define DUMMY_P2_2_SPEED_IV_OVERRIDE (0x0200)
#define DUMMY_P2_2_SP_ATTACK_IV_OVERRIDE (0x0400)
#define DUMMY_P2_2_SP_DEFENSE_IV_OVERRIDE (0x0800)

// MON_DATA_UNK_121  (8 bits) fields


#define SET_MON_HIDDEN_ABILITY_BIT(mon) { \
    u8 tempvarassumeunused = GetMonData(mon, MON_DATA_RESERVED_113, 0); \
    tempvarassumeunused |= DUMMY_P2_1_HIDDEN_ABILITY_MASK; \
    SetMonData(mon, MON_DATA_RESERVED_113, (u8 *)&tempvarassumeunused); \
}
#define SET_BOX_MON_HIDDEN_ABILITY_BIT(boxmon) { \
    u8 tempvarassumeunused = GetBoxMonData(boxmon, MON_DATA_RESERVED_113, 0); \
    tempvarassumeunused |= DUMMY_P2_1_HIDDEN_ABILITY_MASK; \

#define IS_SPECIES_SUBLEGEND(species) ((species == SPECIES_ARTICUNO) || (species == SPECIES_ZAPDOS) || (species == SPECIES_MOLTRES) \
    || (species == SPECIES_RAIKOU) || (species == SPECIES_ENTEI) || (species == SPECIES_SUICUNE) || (species == SPECIES_REGIROCK) \
    || (species == SPECIES_REGICE) || (species == SPECIES_REGISTEEL) || (species == SPECIES_LATIAS) || (species == SPECIES_LATIOS) \
    || (species == SPECIES_UXIE) || (species == SPECIES_MESPRIT) || (species == SPECIES_AZELF) || (species == SPECIES_HEATRAN) \
    || (species == SPECIES_REGIGIGAS) || (species == SPECIES_CRESSELIA) || (species == SPECIES_COBALION) || (species == SPECIES_TERRAKION) \
    || (species == SPECIES_VIRIZION) || (species == SPECIES_TORNADUS) || (species == SPECIES_THUNDURUS) || (species == SPECIES_LANDORUS) \
    || (species == SPECIES_TYPE_NULL) || (species == SPECIES_SILVALLY) || (species == SPECIES_TAPU_KOKO) || (species == SPECIES_TAPU_LELE) \
    || (species == SPECIES_TAPU_BULU) || (species == SPECIES_TAPU_FINI) || (species == SPECIES_KUBFU) || (species == SPECIES_URSHIFU) \
    || (species == SPECIES_REGIELEKI) || (species == SPECIES_REGIDRAGO) || (species == SPECIES_GLASTRIER) || (species == SPECIES_SPECTRIER) \
    || (species == SPECIES_ENAMORUS) || (species == SPECIES_TING_LU) || (species == SPECIES_CHIEN_PAO) || (species == SPECIES_WO_CHIEN) \
    || (species == SPECIES_CHI_YU) || (species == SPECIES_OGERPON) || (species == SPECIES_OKIDOGI) || (species == SPECIES_MUNKIDORI) \
    || (species == SPECIES_FEZANDIPITI))

#define IS_SPECIES_ULTRA_BEAST(species) ((species >= SPECIES_NIHILEGO && species <= SPECIES_BLACEPHALON))

#define IS_SPECIES_PARADOX_FORM(species) ((species >= SPECIES_GREAT_TUSK && species <= SPECIES_IRON_THORNS) || (species == SPECIES_ROARING_MOON) || (species == SPECIES_IRON_VALIANT) || (species == SPECIES_WALKING_WAKE) \
    || (species == SPECIES_IRON_LEAVES) /*|| (species >= SPECIES_GOUGING_FIRE && species <= SPECIES_IRON_CROWN)*/)


// personal narc fields
enum
{
    PERSONAL_BASE_HP = 0,
    PERSONAL_BASE_ATTACK,
    PERSONAL_BASE_DEFENSE,
    PERSONAL_BASE_SPEED,
    PERSONAL_BASE_SP_ATTACK,
    PERSONAL_BASE_SP_DEFENSE,
    PERSONAL_TYPE_1,
    PERSONAL_TYPE_2,
    PERSONAL_CATCH_RATE,
    PERSONAL_EXP_YIELD,
    PERSONAL_EV_YIELD_HP,
    PERSONAL_EV_YIELD_ATTACK,
    PERSONAL_EV_YIELD_DEFENSE,
    PERSONAL_EV_YIELD_SPEED,
    PERSONAL_EV_YIELD_SP_ATTACK,
    PERSONAL_EV_YIELD_SP_DEFENSE,
    PERSONAL_ITEM_1,
    PERSONAL_ITEM_2,
    PERSONAL_GENDER_RATIO,
    PERSONAL_EGG_CYCLES,
    PERSONAL_BASE_FRIENDSHIP,
    PERSONAL_EXP_GROUP,
    PERSONAL_EGG_GROUP_1,
    PERSONAL_EGG_GROUP_2,
    PERSONAL_ABILITY_1,
    PERSONAL_ABILITY_2,
    PERSONAL_RUN_CHANCE,
    PERSONAL_BODY_COLOR,
    PERSONAL_FLIP,
    PERSONAL_TM_ARRAY_1,
    PERSONAL_TM_ARRAY_2,
    PERSONAL_TM_ARRAY_3,
    PERSONAL_TM_ARRAY_4,
};

#define MAX_IVS (31)

#define RND_NO_SET  (0)
#define RND_SET (1)

#define ID_NO_SET   (0)
#define ID_SET  (1)
#define ID_NO_SHINY (2)
#define NO_MOVES_SET    (0xffff)
#define SAME_MOVES_SET  (0xfffe)

typedef struct SEAL {
    u8 kind;           // ID of the seal
    u8 x;              // X coordinate on the capsule
    u8 y;              // Y coordinate on the capsule
} SEAL;

/*
 * Capsule that you put on your ball
 */
typedef struct CAPSULE {
    SEAL seals[8];  // The seals on the capsule
} CAPSULE;

typedef struct {
    /* 0x00 */ u16 species;
    /* 0x02 */ u16 heldItem;
    /* 0x04 */ u32 otID; // low 16: visible; high 16: secret
    /* 0x08 */ u32 exp;
    /* 0x0C */ u8 friendship;
    /* 0x0D */ u8 ability;
    /* 0x0E */ u8 markings; // circle, triangle, square, heart, star, diamond
    /* 0x0F */ u8 originLanguage;
    /* 0x10 */ u8 hpEV;
    /* 0x11 */ u8 atkEV;
    /* 0x12 */ u8 defEV;
    /* 0x13 */ u8 spdEV;
    /* 0x14 */ u8 spatkEV;
    /* 0x15 */ u8 spdefEV;
    /* 0x16 */ u8 coolStat;
    /* 0x17 */ u8 beautyStat;
    /* 0x18 */ u8 cuteStat;
    /* 0x19 */ u8 smartStat;
    /* 0x1A */ u8 toughStat;
    /* 0x1B */ u8 sheen;
    // TODO: Finish SinnohRibbonSet1
    /* 0x1C */ u32 sinnohRibbons;
//    u8 sinnohChampRibbon:1, abilityRibbon:1;
//    u8 field_0x1d;
//    u8 gorgeousRoyalRibbon:1, footprintRibbon:1;
//    u8 field_0x1f;
} PokemonDataBlockA;

typedef struct {
    /* 0x00 */ u16 moves[4];
    /* 0x08 */ u8 movePP[4];
    /* 0x0C */ u8 movePpUps[4];
    /* 0x10 */ u32 hpIV:5, atkIV:5, defIV:5, spdIV:5, spatkIV:5, spdefIV:5, isEgg:1, isNicknamed:1;
    // TODO: Finish HoennRibbonSet
    /* 0x14 */ u32 ribbonFlags; // cool, ...
    /* 0x18 */ u8 fatefulEncounter:1, gender:2, alternateForm:5;
    /* 0x19 */ u8 HGSS_shinyLeaves:6;
    /* 0x19 */ u8 unk_19_6:2;
    /* 0x1A */ u16 Unused;
    /* 0x1C */ u16 Platinum_EggLocation;
    /* 0x1E */ u16 Platinum_MetLocation;
} PokemonDataBlockB;

typedef struct {
    /* 0x00 */ u16 nickname[11];
    /* 0x16 */ u8 Unused;
    /* 0x17 */ u8 originGame;
    // TODO: Finish SinnohRibbonSet2
    /* 0x18 */ u64 sinnohRibbons2; // cool, ...
} PokemonDataBlockC;

typedef struct {
    /* 0x00 */ u16 otTrainerName[8];
    /* 0x10 */ u8 dateEggReceived[3];
    /* 0x13 */ u8 dateMet[3];
    /* 0x16 */ u16 DP_EggLocation;
    /* 0x18 */ u16 DP_MetLocation;
    /* 0x1A */ u8 pokerus;
    /* 0x1B */ u8 pokeball;
    /* 0x1C */ u8 metLevel:7;
    u8 metGender:1;
    /* 0x1D */ u8 encounterType;
    /* 0x1E */ u8 HGSS_Pokeball;
    /* 0x1F */ s8 mood;
} PokemonDataBlockD;

typedef union {
    PokemonDataBlockA blockA;
    PokemonDataBlockB blockB;
    PokemonDataBlockC blockC;
    PokemonDataBlockD blockD;
} PokemonDataBlock;

struct BoxPokemon {
    /* 0x000 */ u32 pid;
    /* 0x004 */ u16 party_lock:1;
                u16 box_lock:1;
                u16 checksum_fail:1;
                u16 Unused:13;    // Might be used for validity checks
    /* 0x006 */ u16 checksum;  // Stored checksum of pokemon
    /* 0x008 */ PokemonDataBlock substructs[4];
};

union MailPatternData
{
    u16 raw;
    struct {
        u16 icon:12;
        u16 pal:4;
    };
};

#define MAILMSG_BANK_NONE           (0xFFFF)
#define MAILMSG_FIELDS_MAX          (2)

typedef struct MailMessage {
    u16 msg_bank;
    u16 msg_no;
    u16 fields[MAILMSG_FIELDS_MAX];
} MAIL_MESSAGE;

typedef struct Mail
{
    u32 author_otId;
    u8 author_gender;
    u8 author_language;
    u8 author_version;
    u8 mail_type;
    u16 author_name[7 + 1];
    union MailPatternData mon_icons[3];
    u16 forme_flags; // bitfield of three 5-bit values
    MAIL_MESSAGE unk_20[3];
} MAIL;

typedef struct PartyOnlyPokemon {
    /* 0x088 */ u32 status; // slp:3, psn:1, brn:1, frz:1, prz:1, tox:1, ...
    /* 0x08C */ u8 level;
    /* 0x08D */ u8 capsule;
    /* 0x08E */ u16 hp;
    /* 0x090 */ u16 maxHp;
    /* 0x092 */ u16 atk;
    /* 0x094 */ u16 def;
    /* 0x096 */ u16 speed;
    /* 0x098 */ u16 spatk;
    /* 0x09A */ u16 spdef;
    /* 0x09C */ MAIL mail;
    /* 0x0D4 */ CAPSULE sealCoords; // seal coords
} PARTYONLYMON;

struct PartyPokemon {
    /* 0x000 */ struct BoxPokemon box;
    /* 0x088 */ PARTYONLYMON party;
}; // size: 0xEC

struct Party
{
    s32 maxPossibleCount;
    s32 count;
    struct PartyPokemon members[6];
};

enum
{
    MON_DATA_PERSONALITY = 0,
    MON_DATA_PARTY_LOCK,
    MON_DATA_BOX_LOCK,
    MON_DATA_CHECKSUM_FAILED,
    MON_DATA_CHECKSUM,
    MON_DATA_SPECIES,
    MON_DATA_HELD_ITEM,
    MON_DATA_OTID,
    MON_DATA_EXPERIENCE,
    MON_DATA_FRIENDSHIP,
    MON_DATA_ABILITY,
    MON_DATA_MARKINGS,
    MON_DATA_GAME_LANGUAGE,
    MON_DATA_HP_EV,
    MON_DATA_ATK_EV,
    MON_DATA_DEF_EV,
    MON_DATA_SPEED_EV,
    MON_DATA_SPATK_EV,
    MON_DATA_SPDEF_EV,
    MON_DATA_COOL,
    MON_DATA_BEAUTY,
    MON_DATA_CUTE,
    MON_DATA_SMART,
    MON_DATA_TOUGH,
    MON_DATA_SHEEN,
    MON_DATA_SINNOH_CHAMP_RIBBON,
    MON_DATA_ABILITY_RIBBON,
    MON_DATA_GREAT_ABILITY_RIBBON,
    MON_DATA_DOUBLE_ABILITY_RIBBON,
    MON_DATA_MULTI_ABILITY_RIBBON,
    MON_DATA_PAIR_ABILITY_RIBBON,
    MON_DATA_WORLD_ABILITY_RIBBON,
    MON_DATA_ALERT_RIBBON,
    MON_DATA_SHOCK_RIBBON,
    MON_DATA_DOWNCAST_RIBBON,
    MON_DATA_CARELESS_RIBBON,
    MON_DATA_RELAX_RIBBON,
    MON_DATA_SNOOZE_RIBBON,
    MON_DATA_SMILE_RIBBON,
    MON_DATA_GORGEOUS_RIBBON,
    MON_DATA_ROYAL_RIBBON,
    MON_DATA_GORGEOUS_ROYAL_RIBBON,
    MON_DATA_FOOTPRINT_RIBBON,
    MON_DATA_RECORD_RIBBON,
    MON_DATA_HISTORY_RIBBON,
    MON_DATA_LEGEND_RIBBON,
    MON_DATA_RED_RIBBON,
    MON_DATA_GREEN_RIBBON,
    MON_DATA_BLUE_RIBBON,
    MON_DATA_FESTIVAL_RIBBON,
    MON_DATA_CARNIVAL_RIBBON,
    MON_DATA_CLASSIC_RIBBON,
    MON_DATA_PREMIER_RIBBON,
    MON_DATA_SINNOH_RIBBON_53,
    MON_DATA_MOVE1,
    MON_DATA_MOVE2,
    MON_DATA_MOVE3,
    MON_DATA_MOVE4,
    MON_DATA_MOVE1PP,
    MON_DATA_MOVE2PP,
    MON_DATA_MOVE3PP,
    MON_DATA_MOVE4PP,
    MON_DATA_MOVE1PPUP,
    MON_DATA_MOVE2PPUP,
    MON_DATA_MOVE3PPUP,
    MON_DATA_MOVE4PPUP,
    MON_DATA_MOVE1MAXPP,
    MON_DATA_MOVE2MAXPP,
    MON_DATA_MOVE3MAXPP,
    MON_DATA_MOVE4MAXPP,
    MON_DATA_HP_IV,
    MON_DATA_ATK_IV,
    MON_DATA_DEF_IV,
    MON_DATA_SPEED_IV,
    MON_DATA_SPATK_IV,
    MON_DATA_SPDEF_IV,
    MON_DATA_IS_EGG,
    MON_DATA_HAS_NICKNAME,
    MON_DATA_HOENN_COOL_RIBBON,
    MON_DATA_HOENN_COOL_RIBBON_SUPER,
    MON_DATA_HOENN_COOL_RIBBON_HYPER,
    MON_DATA_HOENN_COOL_RIBBON_MASTER,
    MON_DATA_HOENN_BEAUTY_RIBBON,
    MON_DATA_HOENN_BEAUTY_RIBBON_SUPER,
    MON_DATA_HOENN_BEAUTY_RIBBON_HYPER,
    MON_DATA_HOENN_BEAUTY_RIBBON_MASTER,
    MON_DATA_HOENN_CUTE_RIBBON,
    MON_DATA_HOENN_CUTE_RIBBON_SUPER,
    MON_DATA_HOENN_CUTE_RIBBON_HYPER,
    MON_DATA_HOENN_CUTE_RIBBON_MASTER,
    MON_DATA_HOENN_SMART_RIBBON,
    MON_DATA_HOENN_SMART_RIBBON_SUPER,
    MON_DATA_HOENN_SMART_RIBBON_HYPER,
    MON_DATA_HOENN_SMART_RIBBON_MASTER,
    MON_DATA_HOENN_TOUGH_RIBBON,
    MON_DATA_HOENN_TOUGH_RIBBON_SUPER,
    MON_DATA_HOENN_TOUGH_RIBBON_HYPER,
    MON_DATA_HOENN_TOUGH_RIBBON_MASTER,
    MON_DATA_HOENN_CHAMPION_RIBBON,
    MON_DATA_HOENN_WINNING_RIBBON,
    MON_DATA_HOENN_VICTORY_RIBBON,
    MON_DATA_HOENN_ARTIST_RIBBON,
    MON_DATA_HOENN_EFFORT_RIBBON,
    MON_DATA_HOENN_MARINE_RIBBON,
    MON_DATA_HOENN_LAND_RIBBON,
    MON_DATA_HOENN_SKY_RIBBON,
    MON_DATA_HOENN_COUNTRY_RIBBON,
    MON_DATA_HOENN_NATIONAL_RIBBON,
    MON_DATA_HOENN_EARTH_RIBBON,
    MON_DATA_HOENN_WORLD_RIBBON,
    MON_DATA_FATEFUL_ENCOUNTER,
    MON_DATA_GENDER,
    MON_DATA_FORM,
    MON_DATA_RESERVED_113,
    MON_DATA_RESERVED_114,
    MON_DATA_HGSS_EGG_MET_LOCATION,
    MON_DATA_HGSS_MET_LOCATION,
    MON_DATA_NICKNAME,
    MON_DATA_NICKNAME_2,
    MON_DATA_NICKNAME_3,
    MON_DATA_NICKNAME_4,
    MON_DATA_UNK_121,
    MON_DATA_GAME_VERSION,
    MON_DATA_COOL_RIBBON,
    MON_DATA_COOL_RIBBON_GREAT,
    MON_DATA_COOL_RIBBON_ULTRA,
    MON_DATA_COOL_RIBBON_MASTER,
    MON_DATA_BEAUTY_RIBBON,
    MON_DATA_BEAUTY_RIBBON_GREAT,
    MON_DATA_BEAUTY_RIBBON_ULTRA,
    MON_DATA_BEAUTY_RIBBON_MASTER,
    MON_DATA_CUTE_RIBBON,
    MON_DATA_CUTE_RIBBON_GREAT,
    MON_DATA_CUTE_RIBBON_ULTRA,
    MON_DATA_CUTE_RIBBON_MASTER,
    MON_DATA_SMART_RIBBON,
    MON_DATA_SMART_RIBBON_GREAT,
    MON_DATA_SMART_RIBBON_ULTRA,
    MON_DATA_SMART_RIBBON_MASTER,
    MON_DATA_TOUGH_RIBBON,
    MON_DATA_TOUGH_RIBBON_GREAT,
    MON_DATA_TOUGH_RIBBON_ULTRA,
    MON_DATA_TOUGH_RIBBON_MASTER,
    MON_DATA_SINNOH_RIBBON_143,
    MON_DATA_OT_NAME,
    MON_DATA_OT_NAME_2,
    MON_DATA_EGG_MET_YEAR,
    MON_DATA_EGG_MET_MONTH,
    MON_DATA_EGG_MET_DAY,
    MON_DATA_MET_YEAR,
    MON_DATA_MET_MONTH,
    MON_DATA_MET_DAY,
    MON_DATA_EGG_MET_LOCATION,
    MON_DATA_MET_LOCATION,
    MON_DATA_POKERUS,
    MON_DATA_POKEBALL,
    MON_DATA_MET_LEVEL,
    MON_DATA_MET_GENDER,
    MON_DATA_ENCOUNTER_TYPE,
    MON_DATA_RESERVED_159,
    MON_DATA_STATUS,
    MON_DATA_LEVEL,
    MON_DATA_CAPSULE,
    MON_DATA_HP,
    MON_DATA_MAXHP,
    MON_DATA_ATTACK,
    MON_DATA_DEFENSE,
    MON_DATA_SPEED,
    MON_DATA_SPECIAL_ATTACK,
    MON_DATA_SPECIAL_DEFENSE,
    MON_DATA_MAIL_STRUCT,
    MON_DATA_SEAL_COORDS,
    MON_DATA_SPECIES_EXISTS,
    MON_DATA_SANITY_IS_EGG,
    MON_DATA_SPECIES_OR_EGG,
    MON_DATA_IVS_WORD,
    MON_DATA_UNK_176,
    MON_DATA_TYPE_1,
    MON_DATA_TYPE_2,
    MON_DATA_SPECIES_NAME,
    MON_DATA_DP_POKEBALL,
    MON_DATA_SHINY_LEAF_A,
    MON_DATA_SHINY_LEAF_B,
    MON_DATA_SHINY_LEAF_C,
    MON_DATA_SHINY_LEAF_D,
    MON_DATA_SHINY_LEAF_E,
    MON_DATA_SHINY_LEAF_CROWN,
    MON_DATA_MOOD,
    MON_DATA_END
};

struct OVERWORLD_TAG
{
    u16 tag;
    u16 gfx; // index in a081
    u16 callback_params;
};


// frick new formes
struct PLIST_DATA
{
    /* 0x00 */ struct Party *pp;
    /* 0x04 */ void *myitem;
    /* 0x08 */ void *mailblock;
    /* 0x0C */ void *cfg;
    /* 0x10 */ void *tvwk;
    /* 0x14 */ void *reg;
    /* 0x18 */ void *scwk;
    /* 0x1C */ void *fsys;
               void *padsmth;
    /* 0x20+4 */ u8 mode;
    /* 0x21+4 */ u8 type;
    /* 0x22+4 */ u8 ret_sel;
    /* 0x23+4 */ u8 ret_mode;
    /* 0x24+4 */ u16 item; // this is actually 0x28
    /* 0x26+4 */ u16 move;
    /* 0x28+4 */ u8 movepos;
    /* 0x29+4 */ u8 con_mode;
    /* 0x2A+4 */ u8 con_type;
    /* 0x2B+4 */ u8 con_rank;
    /* 0x2C+4 */ u8 in_num[6];
    /* 0x32+4 */ u8 in_min:4;
                 u8 in_max:4;
    /* 0x33+4 */ u8 in_lv;
    /* 0x34+4 */ s32 lv_cnt;
    /* 0x38+4 */ u16 after_mons;
    /* 0x3C+4 */ s32 shinka_cond;
};

struct Window
{
    void* /* BgConfig **/ bgConfig;
    u8 bgId;
    u8 tilemapLeft;
    u8 tilemapTop;
    u8 width;
    u8 height;
    u8 paletteNum;
    u16 baseTile  : 15;
    u16 colorMode : 1;
    void *pixelBuffer;
}; //size 0x10


struct PLIST_WORK
{
    /* 0x0 */ void* /* BgConfig **/ bgConfig;
    /* 0x4 */ struct Window windows[_PARTY_MENU_WINDOW_ID_MAX];
    /* 0x284 */ struct Window levelUpStatsWindow[1];       // 0x284
    /* 0x294 */ struct Window contextMenuButtonWindows[8]; // 0x294
    /* 0x314 */ u8 padding_x0[0x654-0x314];
    /* 0x654 */ struct PLIST_DATA *dat;
    /* 0x658 */ void* /*SpriteRenderer **/ spriteRenderer;
    /* 0x65C */ void* /*SpriteGfxHandler **/ spriteGfxHandler;
    /* 0x660 */ void* /*Sprite **/ sprites[_PARTY_MENU_SPRITE_ID_MAX]; // 0x660
    /* 0x6D4 */ u8 padding_x6D4[0xC65-0x660-0x74];
    u8 pos;
};


struct SAVE_MISC_DATA;


// defines from pokeheartgold + new ones
typedef enum EvoMethod
{
    EVO_NONE = 0,
    EVO_FRIENDSHIP,
    EVO_FRIENDSHIP_DAY,
    EVO_FRIENDSHIP_NIGHT,
    EVO_LEVEL,
    EVO_TRADE,
    EVO_TRADE_ITEM,
    EVO_STONE,
    EVO_LEVEL_ATK_GT_DEF,
    EVO_LEVEL_ATK_EQ_DEF,
    EVO_LEVEL_ATK_LT_DEF,
    EVO_LEVEL_PID_LO,
    EVO_LEVEL_PID_HI,
    EVO_LEVEL_NINJASK,
    EVO_LEVEL_SHEDINJA,
    EVO_BEAUTY,
    EVO_STONE_MALE,
    EVO_STONE_FEMALE,
    EVO_ITEM_DAY,
    EVO_ITEM_NIGHT,
    EVO_HAS_MOVE,
    EVO_OTHER_PARTY_MON,
    EVO_LEVEL_MALE,
    EVO_LEVEL_FEMALE,
    EVO_CORONET,
    EVO_ETERNA,
    EVO_ROUTE217,
    EVO_LEVEL_DAY,
    EVO_LEVEL_NIGHT,
    EVO_LEVEL_DUSK,
    EVO_LEVEL_RAIN,
    EVO_HAS_MOVE_TYPE,
    EVO_LEVEL_DARK_TYPE_MON_IN_PARTY,
    EVO_TRADE_SPECIFIC_MON,
    EVO_LEVEL_NATURE_AMPED,
    EVO_LEVEL_NATURE_LOW_KEY,
    EVO_AMOUNT_OF_CRITICAL_HITS,
